{
  "transcript": [
    {
      "timestamp": "0:00",
      "speaker": "Matt",
      "dialogue": "how's it going? Hey?"
    },
    {
      "timestamp": "0:01",
      "speaker": "Nathan",
      "dialogue": "What's going, Matt? How are you?"
    },
    {
      "timestamp": "0:03",
      "speaker": "Matt",
      "dialogue": "I'm in the dream. No, yeah. Got it. Better. I don't know what I'd do... a."
    },
    {
      "timestamp": "0:13",
      "speaker": "Nathan",
      "dialogue": "Anything you're looking forward?"
    },
    {
      "timestamp": "0:14",
      "speaker": "Matt",
      "dialogue": "To this weekend? No, I mean, I would like to do nothing that would be my goal but just gonna\nbe... probably mowing grass and doing fine. Should, so."
    },
    {
      "timestamp": "0:28",
      "speaker": "Nathan",
      "dialogue": "Yeah, that's on my agenda the former nothing."
    },
    {
      "timestamp": "0:33",
      "speaker": "Matt",
      "dialogue": "Yeah. Well, one day I'll get that opportunity again, so."
    },
    {
      "timestamp": "0:41",
      "speaker": "Nathan",
      "dialogue": "It'll come, it'll come. We're almost there, but I man, I was gonna say I appreciate, you hoppingon quick here after a call from one day, it seems like it resonated pretty well with Brian."
    },
    {
      "timestamp": "0:55",
      "speaker": "Matt",
      "dialogue": "Yeah, yeah. I mean, I think, you know, ultimately... I think the gut feel and it is probably our\nbetter ABM and zoom's better data, and that's it doesn't really probably change our discussion\nthat we were having, but it probably, you know, diminishes the cross sell opportunity... you\nknow, to get the sales side of the house in the fold."
    },
    {
      "timestamp": "1:28",
      "speaker": "Nathan",
      "dialogue": "Mind, just like if I had pack that a little bit like is for me? Is he... I guess based on what he, like\nhe saw is he like definitive that he thinks like Zoom info is like contact data? Is that what he\nthinks, is better? Yeah."
    },
    {
      "timestamp": "1:44",
      "speaker": "Matt",
      "dialogue": "Yeah. That's that's where he's at and, I, us, I got on a call with them earlier today and they were\nkind of diving into the marketing side of things... just because I told him, you know, I would\nentertain it and it's... yeah, it's one of those fun things that it's great to, well, they rely on\nBombora, and it's only social media and I'm like it's not 100 percent true but, okay. Yeah."
    },
    {
      "timestamp": "2:14",
      "speaker": "Nathan",
      "dialogue": "Yeah."
    },
    {
      "timestamp": "2:16",
      "speaker": "Matt",
      "dialogue": "So, you know, I mean, it's I... you just got, you got to get to the bottom, of the BS train on them,\nwhich is fun. So, yeah, yeah."
    },
    {
      "timestamp": "2:27",
      "speaker": "Nathan",
      "dialogue": "Yeah... you know, based on what I understand about like, you know, abc as far as like what the\nteam is looking to accomplish. I mean, I think like contact data is it must have obviously and\nthen you guys are all on the same page that, you must have contact data. Like I mentioned on\nthe last call candidly, there's roughly like 10 to 15 vendors who offer contact data at a pretty\nclose percentage point of accuracy. And like I'm more than happy to like test our contact data\nagainst suminfos."
    },
    {
      "timestamp": "2:58",
      "speaker": "Matt",
      "dialogue": "Yeah. And, I think that's where we've got to be. I mean, the challenges that, I mean, your\npublished stats puts you at a disadvantage in comparison to what Zoom offers on that front...\nand... you know, it's and so like, you know, I'm dealing with, I'm trying to find because you've\nsent me a couple of texts."
    },
    {
      "timestamp": "3:31",
      "speaker": "Nathan",
      "dialogue": "Yeah. And the one thing that I'll obviously let you carry on. Yeah, the one thing that I'll say is\nthat... you've noticed in the published stats. So like our contact coverage, is only getting\nstronger as far as that's like, the universe of contexts that we have. Obviously, it's gonna be alittle bit different when you start to think about health care. And like honestly, I don't know\nhow,\nthe contact data test is going to run versus info. I'm obviously willing to try like where sales\nteams find more value is pairing the contact data with intent. Is that something, that Brian is\ntaking into consideration in his value, the intent data part of it?"
    },
    {
      "timestamp": "4:17",
      "speaker": "Matt",
      "dialogue": "Yeah. Why isn't his primary focus? It's marketing's primary focus on, you know, like he's thinking\nlike the way salespeople used to be in that. I'm gonna go get my people. I'm gonna go target\nand I need to get all the contacts I can get there. And I'm gonna go, and penetrate and I'm like,\nwell, we can do it smarter, you know, like I think you should do that, but I might be able to\nprioritize like a handful of people you should be reaching out to each day that are like higher in\nand more likely to respond to, you know... no. I mean, I think he's like that's cool. It's just,"
    },
    {
      "timestamp": "4:54",
      "speaker": "Matt",
      "dialogue": "you know, he still wants that expand some data set of contacts, so."
    },
    {
      "timestamp": "5:00",
      "speaker": "Nathan",
      "dialogue": "Yeah, I."
    },
    {
      "timestamp": "5:01",
      "speaker": "Matt",
      "dialogue": "see."
    },
    {
      "timestamp": "5:01",
      "speaker": "Nathan",
      "dialogue": "Pretty pretty similar if we can potentially like if you'd be open to like another conversation with\nBrian at least like coordinating one unless he's completely already made up his mind and."
    },
    {
      "timestamp": "5:13",
      "speaker": "Matt",
      "dialogue": "I don't think he's made of his mind. I think he wants to get to a decision quickly. So it's like\nyou, you've got and I'm going to start with backend. I need to like we need to nail down like\nwhat we're talking about from a pricing perspective too because then that is a component of a\ndecision too, but got it."
    },
    {
      "timestamp": "5:28",
      "speaker": "Nathan",
      "dialogue": "Yeah, absolutely. I mean, obviously, you know, the other things I take into consideration like if\nyou're gonna think about using Zoominfo for, you know, your sales outreach your contact data,\nyou have xyz that is going to handle the marketing side like leveraging one tool for both helps\nwith the consolidation that I'm sure like the, your CFO is gonna care about your CEO is."
    },
    {
      "timestamp": "5:51",
      "speaker": "Matt",
      "dialogue": "No, I mean, I agree with that, but I mean, if one's better in one case and one's better in the other\nthan it is what it is, they technically will fall under different budgets. So, yeah.6:03 | Nathan\nLike I said, we could talk through that as far as marketing. Like we like price side, you know, it's\njust us to here. Like are you confident that like enough for your like supportive of six on like the\nmarketing side?"
    },
    {
      "timestamp": "6:18",
      "speaker": "Matt",
      "dialogue": "I mean, I like it. I do, I mean... it's kinda funny. Like... I don't feel like I've gotten my hands dirty\nenough to have like, you know, infinite comfort and I don't know what the pricing is. So, I like,\nyou know, it's hard for me, to say on that front."
    },
    {
      "timestamp": "6:45",
      "speaker": "Matt",
      "dialogue": "Yeah, that's where my heads at."
    },
    {
      "timestamp": "6:47",
      "speaker": "Nathan",
      "dialogue": "Okay. Like I said, like price side, like how do we get you from liking it, to loving it?"
    },
    {
      "timestamp": "6:54",
      "speaker": "Matt",
      "dialogue": "Yeah. I mean, I think... diving in and saying like, what am I gonna do on? What is my team\ngonna do on a daily or weekly basis with it? And, and start... you know, realizing how, it\nchanges the way we work because, you know, we're not coming at it from a perspective. We've\nbeen doing it in a very intelligent way and so that's there's an operational flow of things that, you\nknow, we just need, to internalize and make sure we understand. So, yeah, I mean, like I've\ngone down the path with a, and this was like six months ago when, you know, I'm just doing\nexploration and how we could expand upon what we were improving, you know, on a small test\nto be successful, you know, when we're able to upload our, you know, a list of contacts and they\nwere able to spit back out, you know, information on... you know, which ones of those are\nactually actively pursuing. And based on, our topics and things like that, we probably need to\nget into, that bucket, of thinking that deeply about it to see what you've got what we can do with\nit, and then how we operationalize that and get smarter and be more effective. So."
    },
    {
      "timestamp": "8:17",
      "speaker": "Nathan",
      "dialogue": "Yeah. And so seeing what we have is that in relation to like the data that we're able to capture,\nfor abc like running that data tests that we were talking about?"
    },
    {
      "timestamp": "8:27",
      "speaker": "Matt",
      "dialogue": "Yeah, yeah."
    },
    {
      "timestamp": "8:28",
      "speaker": "Nathan",
      "dialogue": "Okay. Cool. Assuming that goes well and I can resend the instructions of like how, we set that\nup as far as like a data test... what you were looking to see is like what the data looks like? Is\nthere valuable intent data both from like a first and third party perspective? And then are you still\nlooking, to get a better understanding of like how you action that data?8:53 | Matt\nYeah. Me."
    },
    {
      "timestamp": "8:54",
      "speaker": "Nathan",
      "dialogue": "Okay. I know that when we talked like first, you were like, you know, there was so much\nrebranding like website finishing up that, you know, you kind of pause on running ads like\nDisplay ads, social like what do you like? What kind of like ads do you plan on running and like\ngenerating?"
    },
    {
      "timestamp": "9:10",
      "speaker": "Matt",
      "dialogue": "We do."
    },
    {
      "timestamp": "9:10",
      "speaker": "Nathan",
      "dialogue": "We do little bit of."
    },
    {
      "timestamp": "9:11",
      "speaker": "Matt",
      "dialogue": "On Linkedin today, we do a little bit, on google for search and we do some Retargeting today.\nAnd that's a pretty small budget assigned to it right now. So."
    },
    {
      "timestamp": "9:25",
      "speaker": "Nathan",
      "dialogue": "Cool. So data test one, how you would leverage that data too after that? Like what else do you\nthink you would need to see in order to feel comfortable... price obviously. But aside from that?"
    },
    {
      "timestamp": "9:42",
      "speaker": "Matt",
      "dialogue": "Price, is a component of it?"
    },
    {
      "timestamp": "9:48",
      "speaker": "Matt",
      "dialogue": "And then I guess like... you're purely looking at it from an ABM ad perspective, right? From a\nmarketing side. So we're, the de, anonymizing data, the dark funnel, your approach to doing\nthat. If I don't have the sales component, I'm not getting into contact info. Is, a, is that fair or?"
    },
    {
      "timestamp": "10:16",
      "speaker": "Nathan",
      "dialogue": "Like emails and phone numbers? I mean, it's not part of this package. Now, what would be\nlooking to do, is it like more so like who you like head up via e-mail campaigns? Like nurture\ncampaigns, stuff like that?"
    },
    {
      "timestamp": "10:31",
      "speaker": "Matt",
      "dialogue": "Yeah, yeah."
    },
    {
      "timestamp": "10:32",
      "speaker": "Nathan",
      "dialogue": "Cool. Yeah. I mean, you can purchase new contacts, like with what we call is. Orchestrations. Is\nhonestly every customer of mine that like buys marketing, buys Orchestrations. It's the\nautomation part of, our solution. It's... buying contacts, you know, enriching accounts. It'spushing segments out to your marketing automation, your CRM. So like that's all accomplished\nwithin the marketing side. Should you like need that, and need to do that? Cool. I mean seems\nto be pretty straightforward. I know Brian is looking to move pretty quickly. Like how quick are\nyou looking to move on this initiative?"
    },
    {
      "timestamp": "11:18",
      "speaker": "Matt",
      "dialogue": "I mean, he's got an Immediate need and I'm in the middle, of taking is into being more proactive\nand, you know, we're doing some things that are light lift for us. And I want to get more laser\nfocused. The light lift is more broad spectrum, and I would like to be more Targeted. So what\nwe're discussing, is really me pushing... to build out the remainder of the year, how we're gonna\ngo about it. And then, what we're doing next year?"
    },
    {
      "timestamp": "11:50",
      "speaker": "Nathan",
      "dialogue": "Okay. Does that mean that you'd want something like up and running before? Like the halfway\npoint of the year of like June?"
    },
    {
      "timestamp": "11:59",
      "speaker": "Matt",
      "dialogue": "They, they have way point end of June, maybe end of June? Maybe maybe real? Yeah."
    },
    {
      "timestamp": "12:06",
      "speaker": "Nathan",
      "dialogue": "Yeah. I was gonna say like what I, do you operate on a standard calendar fiscal or like a?"
    },
    {
      "timestamp": "12:11",
      "speaker": "Matt",
      "dialogue": "Feel like an operator on a standard calendar?"
    },
    {
      "timestamp": "12:13",
      "speaker": "Nathan",
      "dialogue": "No, like, you know what I mean?"
    },
    {
      "timestamp": "12:16",
      "speaker": "Matt",
      "dialogue": "These are the ground re, shapes underneath my feet, on a daily basis. So, yeah."
    },
    {
      "timestamp": "12:20",
      "speaker": "Nathan",
      "dialogue": "Year start in february is what it or january?"
    },
    {
      "timestamp": "12:23",
      "speaker": "Matt",
      "dialogue": "Well, yeah, no, I mean, I pretty much operated on the calendar here instead of this year, but it's\njust, yeah, I mean, it's like, the challenge I've got is that I've got a team of four and we're pulling\na lot of directions. So I'm still doing a lot of reactive stuff and I'm trying to plan the proactive side\nof things. So we're gonna do something with ABM whether or not I get it done by the end of\nJune or it happens in the end of july or whatever. I'm indifferent to that, because again, I know I\nwas just told I need to build a strategy for the payer market and I'm like focused on the ship that\nwe've got in, right?13:04 | Nathan\nYeah. So."
    },
    {
      "timestamp": "13:06",
      "speaker": "Matt",
      "dialogue": "Yeah. So, I literally, this is where I am. I know I'll get my gripe done. I went up to new York. We\nhad an alignment meeting with a leadership team and we focused on our three areas of\npriorities and payers were like, we're not gonna do that. Now. I'm a month out from that and\npayers are becoming a priority for me. So, yeah, I."
    },
    {
      "timestamp": "13:31",
      "speaker": "Nathan",
      "dialogue": "where's the disconnect?"
    },
    {
      "timestamp": "13:33",
      "speaker": "Matt",
      "dialogue": "I mean, it's just, we are, we're running a mock five, like it just is what it is."
    },
    {
      "timestamp": "13:40",
      "speaker": "Nathan",
      "dialogue": "Yeah. Interesting. You had that meeting like when you justify this, like your CEO, CFO, like\nknowing that this is more of a proactive, like has there been a conversation that like technology\nat least for like the marketing ABM site is needed?"
    },
    {
      "timestamp": "13:57",
      "speaker": "Matt",
      "dialogue": "We've had discussions about, you know, how we were leveraging it. And like I told you, I did a\nsmall test focusing on targeting positions. They were physician leaders, and we proved that we\ncould be really effective at getting them in. The, the downside of the data set I had... was that...\nI called a lot of small physician leaders in it... and which was fine from what I was testing. But\nthat datasets just gonna work for enterprise health care, but, I approved it. It was low cost and\nso we've got complete justification for it. But what I'm in the middle of trying to do is we like get\nsome stuff off my plate. I've got a few big projects that I'm just trying to get wrapped and I want\nto come out and say this is my plan. This is how marketing is gonna work. This isn't gonna be\nour approach to doing it. And this is how it's going to help the funnel faster. And here's where\nwe're going to spend our money which is going to include the cross section of all sorts of stuff\nfrom events and down to, you know, CRO approaches to ABM. So."
    },
    {
      "timestamp": "15:01",
      "speaker": "Nathan",
      "dialogue": "Yeah. I remember the first thing, you mentioned earlier first call was like you want to increase\nyour MQL like decrease the cost of an MQL and like reduce like the customer acquisition cost.\nYou said like just start from the MQL is like where are you trying to get to you? Like from what to\nwhat when you're like increasing MQL like a quantitative number."
    },
    {
      "timestamp": "15:21",
      "speaker": "Matt",
      "dialogue": "I mean, we're doing fine on it. I mean, I'm exceeding expectations, on that. I think what we're not\ndoing is really staying. We're not keeping that group warm. And part of that is because the\nsyndication campaigns are like look warm. I mean, they did download our content but theydownloaded it off another site backers or he's media sites. And so we've got to do something, to\nengage them more and again, that's where an ABM strategy comes into play and we start being\nmore proactive on that front. So I would... a, I think getting those mqls deeper into the funnel\nfaster, is probably, the key to it and then lowering the cost of the acquisition."
    },
    {
      "timestamp": "16:15",
      "speaker": "Nathan",
      "dialogue": "Yeah, it sounds like you're able to get the mqls, it's the conversion on them that we're looking to\nimprove on."
    },
    {
      "timestamp": "16:23",
      "speaker": "Matt",
      "dialogue": "I didn't do a great job reaching out to them either. I mean, they were switching CRMS and we\nhave like two people on the sales team and I had this flood of mqls that came in overnight and\nthey were like, what the fuck? Yeah, yeah."
    },
    {
      "timestamp": "16:36",
      "speaker": "Nathan",
      "dialogue": "And that's something that I would like bring up to Brian is like, you know, all leads aren't created\nequal, right? Like, you know, if someone downloads something they could be, you know, doing\nsome research at a university that, they might not be a real buyer. What, what brian's team? I'm\nsure they're gonna care about and like what motivates any sales rep because like sales reps,\nlike part of my french bucking at prospecting is like motivating them to know like who is actually\nshopping for what you're selling? And if you can, then everyone can give you their e-mail and\nphone number. Like there's 10 tools that do that. That's like the argument that I would make with\nBrian is like, hey, like we're you know, happy to test our data. But like, you know, when you think\nabout what you're looking to accomplish here, it's like, do you want to like get more like just, you\nknow, spray and pray or is it like you need to get some like active opportunities so we can\ngenerate, some revenue and convert on those. So that's the direction, that I mean, I try to take\nwith Brian. Yeah."
    },
    {
      "timestamp": "17:38",
      "speaker": "Matt",
      "dialogue": "No, I mean, I'm with you and, I think it did in a day like I got to get down to the cost structure on\ntoo. Like what am I looking at? You know?"
    },
    {
      "timestamp": "17:44",
      "speaker": "Nathan",
      "dialogue": "It, so for the marketing side only just like bare bones like, no, none of like the sales part of it\nannually. You'd be looking at roughly like 50 K per year for marketing, operate on like standard\ntwo year terms. That would just be like everything that we've talked about from like the ABM\nside as well as like the automation that's the 50 K there. If you were to start to include sales. I\nthink the number that Brian shots me, it was like roughly like six users depending on like the\ncredit allotment and credits is like how you unlock emails phone numbers. And like each credit\nunlocks like one contact worth looking at roughly like 25 to 30 K annually. On the sales side, you\ncan obviously like move forward on a car, both of them together. But that's pretty straightforward\nof what you'd be looking at in terms of like our list price of our two offerings."
    },
    {
      "timestamp": "18:52",
      "speaker": "Matt",
      "dialogue": "They've got, and I'm just giving you what Zoom gave him. They're like a 23 K for 10 users. We\ndon't have 10 users in the user right now, but... that is 10,000 bulk data credits."
    },
    {
      "timestamp": "19:09",
      "speaker": "Nathan",
      "dialogue": "Yeah. Can we're not gonna be the cheapest solution? I know it, we're offering, a totally different\nset of data in addition to."
    },
    {
      "timestamp": "19:19",
      "speaker": "Matt",
      "dialogue": "The same level of data?"
    },
    {
      "timestamp": "19:20",
      "speaker": "Nathan",
      "dialogue": "With like the contact data, like their intent doesn't nearly stack up to where we."
    },
    {
      "timestamp": "19:24",
      "speaker": "Matt",
      "dialogue": "Yeah, this is not intent based. This is their data side of it. So."
    },
    {
      "timestamp": "19:27",
      "speaker": "Nathan",
      "dialogue": "Right. And a, ours includes their data, and intent a similar price point there. And if you\nremember like the credit allotment, I'm not sure what they quoted as far as like the total amount\nof credits, but ours are a pool of credits that you can allow to reps as needed."
    },
    {
      "timestamp": "19:50",
      "speaker": "Matt",
      "dialogue": "10,000 bulk credits, and how many credits are you talking about?"
    },
    {
      "timestamp": "19:55",
      "speaker": "Nathan",
      "dialogue": "So, if you're looking at like six users, five, like 50,000 credits like across all of the users like that\nwould roughly be in the 25 K range."
    },
    {
      "timestamp": "20:09",
      "speaker": "Matt",
      "dialogue": "Yeah. Okay. Yeah. So we've got 10, 10 bulk data credits, whatever that means plus a 1,000\nmonthly recurring credits per user... that's what it is."
    },
    {
      "timestamp": "20:28",
      "speaker": "Matt",
      "dialogue": "So, 12,000 credits per user plus 10,000 bulk credits for, I guess, I don't know. So."
    },
    {
      "timestamp": "20:35",
      "speaker": "Nathan",
      "dialogue": "Yeah. I mean, it's just, they're allotted in a different way the way he, yeah, absolute."
    },
    {
      "timestamp": "20:42",
      "speaker": "Matt",
      "dialogue": "Yeah. So yours was for six users and 50,000 credits, right?20:51 | Nathan\nYeah. I mean, that's just like what like list prices, obviously, like we work with Brian to make sure\nthat we can get into like a commercially like comfortable spot where he's competent, that\nxyz is a better fit. And then from there, we could obviously like sharpen the pencil. Like that's our\nlist price, you know, and I'm sure connect with Zoom info, like they probably discuss some\ndiscounting and like that hasn't been included at all... areas that we care about are like, I'm sure,\nyou know, like sales, it's timing of signature, right? Like if Brian is committed to like executing\nsomething in may, like we can reward them in the form of a discount there. There's areas that\nwe can sharpen the pencil forum. We just kinda need a seat at the table to talk to Brian again."
    },
    {
      "timestamp": "21:36",
      "speaker": "Matt",
      "dialogue": "Yeah, I mean, I'm not shielding you from it. I told him, I was chatting with you and, you know,\nwe're both, I think aligned on what would be advantageous for us. So... I will get back to him. I\njust need, I would love to like have a proposal, that I can like, yeah, I just gonna give, I can give\nyou a."
    },
    {
      "timestamp": "22:02",
      "speaker": "Nathan",
      "dialogue": "I can send it over like just pulling a proposal isn't the easiest thing, but like this is the number,\nlike I can give you like, the dollar amount for those users."
    },
    {
      "timestamp": "22:12",
      "speaker": "Matt",
      "dialogue": "When I get and what I get with each side of it, so you got the 50 K for the marketing side. What\ndo I get with, you know?"
    },
    {
      "timestamp": "22:18",
      "speaker": "Nathan",
      "dialogue": "Yeah, the features to."
    },
    {
      "timestamp": "22:19",
      "speaker": "Matt",
      "dialogue": "Yeah."
    },
    {
      "timestamp": "22:21",
      "speaker": "Nathan",
      "dialogue": "For sure. Cool. Well."
    },
    {
      "timestamp": "22:23",
      "speaker": "Matt",
      "dialogue": "Because I don't feel like I've got anything tangible. I'm gonna put my hands on front of me. I've\ngot some general overviews but I just, I can't see my teeth into anything yet. So."
    },
    {
      "timestamp": "22:31",
      "speaker": "Nathan",
      "dialogue": "Yeah, I'll break it out of what you can get and that's like part of like what we're the next few steps\nthat we've outlined is like let's get your data and like let's get you access to like, you know, when\nwe get on a demo, I'll bring, my solutions consultant, Andy, and we'll walk through like the data,\nwe'll walk through, how you action it, all of those things that you care about to like moreeffectively, like build that pipeline more effectively, like, you know, improve those conversion\nrates, like we'll walk through that? It's just a matter of like setting up time, to review your data.\nSo... what I'll do is I'll send over the instructions... as far as seeing the platform. I know we went\nthrough a high level demo a few weeks ago. Do you wanna run through one of like looking at\nxyz data or do you wanna just like wait till yours, is fully populated? Because we can show you\nthe workflows again."
    },
    {
      "timestamp": "23:28",
      "speaker": "Matt",
      "dialogue": "Yeah. I mean, I don't want to do it right now because, I think."
    },
    {
      "timestamp": "23:34",
      "speaker": "Nathan",
      "dialogue": "Trevor."
    },
    {
      "timestamp": "23:35",
      "speaker": "Matt",
      "dialogue": "on my team, yeah. Yeah. I think Trevor on my team used to get engaged to."
    },
    {
      "timestamp": "23:45",
      "speaker": "Nathan",
      "dialogue": "So, how about this? Yeah... let me pull up my calendar."
    },
    {
      "timestamp": "23:54",
      "speaker": "Nathan",
      "dialogue": "How soon do you think you can get like the web tag up on the site?"
    },
    {
      "timestamp": "23:58",
      "speaker": "Matt",
      "dialogue": "I'm at google tag manager today."
    },
    {
      "timestamp": "24:01",
      "speaker": "Nathan",
      "dialogue": "Okay, cool. I'll send that right over."
    },
    {
      "timestamp": "24:09",
      "speaker": "Nathan",
      "dialogue": "Let's stay in touch. Do you think... after memorial day, so that we have a significant amount\nof website data that we can pull for you?"
    },
    {
      "timestamp": "24:24",
      "speaker": "Matt",
      "dialogue": "So, you're looking at, the 20 seventh?"
    },
    {
      "timestamp": "24:27",
      "speaker": "Nathan",
      "dialogue": "Yeah, that's not a."
    },
    {
      "timestamp": "24:30",
      "speaker": "Matt",
      "dialogue": "Yeah. I think that's fair."
    },
    {
      "timestamp": "24:37",
      "speaker": "Matt",
      "dialogue": "I think that's fair. Yeah.24:39 | Nathan\nCool. And then, I mean, at that point, do you think calendars open the 28, 20 ninth, we can\ndescribe like an hour to review it?"
    },
    {
      "timestamp": "24:47",
      "speaker": "Matt",
      "dialogue": "Yeah. Let me pull that week up."
    },
    {
      "timestamp": "24:54",
      "speaker": "Matt",
      "dialogue": "20 ninth... three 30 to five. I'm open 28 kind of sucks."
    },
    {
      "timestamp": "25:06",
      "speaker": "Nathan",
      "dialogue": "A three 30 to five. I got to four to five already on the 29. Do you have an all?"
    },
    {
      "timestamp": "25:13",
      "speaker": "Matt",
      "dialogue": "One."
    },
    {
      "timestamp": "25:13",
      "speaker": "Nathan",
      "dialogue": "Two zero one. Sorry about that. Okay?"
    },
    {
      "timestamp": "25:19",
      "speaker": "Matt",
      "dialogue": "I can't do the morning because I want to E, I want to get Trevor on it and he's specific."
    },
    {
      "timestamp": "25:31",
      "speaker": "Matt",
      "dialogue": "I could bump my one 30 zoo 30... or we could do, we could do. What, what? What about two to\nthree? I'll just shorten this?"
    },
    {
      "timestamp": "25:42",
      "speaker": "Nathan",
      "dialogue": "Let's do it. Yeah, perfect. I'll send that over between us to. Do, you know how soon Brian is\nlooking to make a decision like within the next?"
    },
    {
      "timestamp": "25:53",
      "speaker": "Matt",
      "dialogue": "Yeah. I mean, he wanted to make a decision yesterday on stock. So, okay."
    },
    {
      "timestamp": "25:58",
      "speaker": "Nathan",
      "dialogue": "So, do you recommend that I reach out to him directly?"
    },
    {
      "timestamp": "26:05",
      "speaker": "Matt",
      "dialogue": "I mean, I think he's waiting on the cost structure of it just as much as I am. So, and if you give\nme that to, and then I can sit down and talk with him and be like, you know, the bonus of doing it\nfrom ABM side, is that you get the intent and you get the contact information on the people\nhitting your site. You do it separate, you just get the contact info and you have to go surface that\nshit. So.26:30 | Nathan\nI'll get that all."
    },
    {
      "timestamp": "26:32",
      "speaker": "Matt",
      "dialogue": "Yeah... sweet."
    },
    {
      "timestamp": "26:37",
      "speaker": "Nathan",
      "dialogue": "Excited to get the data test running. I think it should be really impactful. Yeah, it's all I got a,"
    },
    {
      "timestamp": "26:46",
      "speaker": "Matt",
      "dialogue": "okay. Yeah. So, yeah. So that over to me. And now I'll throw in google tag manager today, so."
    },
    {
      "timestamp": "26:53",
      "speaker": "Nathan",
      "dialogue": "Perfect. Awesome. Well, I'll get working on that. Appreciate it map."
    },
    {
      "timestamp": "26:57",
      "speaker": "Matt",
      "dialogue": "Cool. Thanks. Bye bye."
    }
  ]
}