{
  "transcript": [
    {
      "timestamp": "0:00",
      "speaker": "Nathan",
      "dialogue": "what's going on there?"
    },
    {
      "timestamp": "0:02",
      "speaker": "Andy",
      "dialogue": "Not much. How are you?"
    },
    {
      "timestamp": "0:05",
      "speaker": "Nathan",
      "dialogue": "I'm like already fried?"
    },
    {
      "timestamp": "0:07",
      "speaker": "Andy",
      "dialogue": "Yeah."
    },
    {
      "timestamp": "0:09",
      "speaker": "Nathan",
      "dialogue": "I just have been... in tel, agree, was that one that you worked? No, that's job. Sorry, different\naccount basically sent over there's. Like a list of like random people that they wanted to, for us\nto enrich. And there's just like so many discrepancies and like people like them, not even still\nworking at the company... kind of like, how did you get this list on? So I have to figure that out\nwith them. But... how are you doing?"
    },
    {
      "timestamp": "0:45",
      "speaker": "Andy",
      "dialogue": "All right, super busy, but going on, but I think like, the plane is going to love a lot. It looks like in\nthe coming weeks... I finally realized why I'm so busy. It's because I came back from Pat leave.\nAnd instead of like a slow ramp of like building accounts, which kind of happened like it all kind\nof came on. And then all the accounts turned on it once, you know."
    },
    {
      "timestamp": "1:16",
      "speaker": "Andy",
      "dialogue": "Yeah. So like I had like all these like first time demos back to back to back and like, I feel like\nnow everything's like usually my book is like stagger and it's like, okay, I've got some late stage.\nI've got some midstage and I've got like some that like give them a few weeks and maybe they'll\nbring me in. Yeah, but like right now, I'm just like every op I'm on, I'm like involved in because\nthey're all brand new and they all kind of activated at the same time."
    },
    {
      "timestamp": "1:43",
      "speaker": "Nathan",
      "dialogue": "Yeah, I get that they're all just like progressing at the same time instead of like having it\nstaggered. Yeah."
    },
    {
      "timestamp": "1:52",
      "speaker": "Andy",
      "dialogue": "But it's starting to level out which is good. And then, yeah."
    },
    {
      "timestamp": "1:57",
      "speaker": "Nathan",
      "dialogue": "Nice. Well, I talked to Matt on Friday afternoon for a while. He, he seems to be very much on\nboard... Matt as like their VP of marketing. Yeah, and like we can talk through it after more as\nwell. But like, he knows that he wants to make a decision with sales and marketing with the\nsame tool, the business case being much easier to make. In that case. Like internally... for him,\nit's like we've been easier to work with if price wasn't an option, he'd move forward with us. Like\nhe's on like he's getting to where we need him to get to it's. Like, hey, like this call is going to be\nimportant that we get both parties thinking the same way. Yeah. So, I think we just like basically,\nwe're on the same call that we did last time just to continue to build that confidence of like, hey\nhere's, why we're doing what we're doing here's. Why it matters here's. Why the way that we go\nabout it's like going to help you more effectively."
    },
    {
      "timestamp": "3:10",
      "speaker": "Andy",
      "dialogue": "Yeah. Now, who said that they would do the direct comparison against Zoominfo, good caution\nbecause we still have yet to get confirmation there objectively. Like... I mean, especially from a\nbuying team who is comparing our numbers to Zoominfo globally, I would hope they want to\nactually run the same test with Zoominfo and see what actually came of it. Yeah."
    },
    {
      "timestamp": "3:37",
      "speaker": "Nathan",
      "dialogue": "Yeah."
    },
    {
      "timestamp": "3:43",
      "speaker": "Nathan",
      "dialogue": "Let me message him to make sure that he's not ghosting again."
    },
    {
      "timestamp": "4:31",
      "speaker": "Nathan",
      "dialogue": "All right. Just e-mail them."
    },
    {
      "timestamp": "4:49",
      "speaker": "Andy",
      "dialogue": "Well, they do, they have Zoominfo right now, no, they don't so they have to ask Zoom info to do\nthe same thing. But if, I mean, I, but at the same time, it's like it's not that hard, like give them\nthe same account list, give them the same titles and personas and pull the numbers, you know,\nlike, I give E, you can give them our results. I don't care, you know, but like... in my mind, if they\ndon't do that, then they don't have really E, I don't think it's fair for them to say we care about\nquantity. Yeah, if they're not going to actually do that. It's like you can't tell us you care about\nquantity, we tell you our quantity and then you don't go check with Zoominfo. You know, I don't\nknow."
    },
    {
      "timestamp": "5:37",
      "speaker": "Nathan",
      "dialogue": "You're 1,000 percent, right?"
    },
    {
      "timestamp": "5:42",
      "speaker": "Andy",
      "dialogue": "I don't know, Brian just, you'll delete all this from the recording, I hope. But Brian, he just seems\nvery distracted and disconnected from this Evaluation... like."
    },
    {
      "timestamp": "5:57",
      "speaker": "Nathan",
      "dialogue": "He, he's like, just like latching on to like the first thing he heard of like having more. And then like\nthat's literally just been stuck in his. I,"
    },
    {
      "timestamp": "6:07",
      "speaker": "Andy",
      "dialogue": "I don't feel like he's giving this thought like on calls, I don't feel like he's with us. I feel like he's\nmultitasking. I, and I feel like outside of our calls, I don't think he's even thinking about our calls\nor xyz or a vendor. I think he's got other priorities on his head."
    },
    {
      "timestamp": "6:27",
      "speaker": "Nathan",
      "dialogue": "And."
    },
    {
      "timestamp": "6:28",
      "speaker": "Andy",
      "dialogue": "as I think Matt is really involved in thinking about this, I think Brian is just like Zoom info has got\nphone numbers and I want phone numbers and like they're probably going to give us a cheaper\nprice, just go with them, you know?"
    },
    {
      "timestamp": "6:42",
      "speaker": "Nathan",
      "dialogue": "Yeah."
    },
    {
      "timestamp": "6:43",
      "speaker": "Andy",
      "dialogue": "Hopefully that's me being pessimistic and paranoid, but hopefully I'm wrong, but I don't know.6:51 | Nathan\nNow, I hear you."
    },
    {
      "timestamp": "6:55",
      "speaker": "Andy",
      "dialogue": "But at the same time, that's okay if Brian does that and feels that way, as long as he's okay,\nletting Matt say, yeah, we're gonna go with xyz for everything because if you're not passion on\nthe sales side and xyz hasn't given us any red flags on their contact data, please. Let me get\nxyz marketing because I'm passionate on that side. You still get what you need, you know?"
    },
    {
      "timestamp": "7:21",
      "speaker": "Nathan",
      "dialogue": "Yeah."
    },
    {
      "timestamp": "8:11",
      "speaker": "Nathan",
      "dialogue": "Do I don't have any credits anymore... when?"
    },
    {
      "timestamp": "8:15",
      "speaker": "Andy",
      "dialogue": "Instance or human?"
    },
    {
      "timestamp": "8:17",
      "speaker": "Nathan",
      "dialogue": "I'm probably in the."
    },
    {
      "timestamp": "8:25",
      "speaker": "Nathan",
      "dialogue": "demo one that's probably why?"
    },
    {
      "timestamp": "8:31",
      "speaker": "Nathan",
      "dialogue": "I'm just trying to find this phone, not really quick to call him."
    },
    {
      "timestamp": "8:57",
      "speaker": "Nathan",
      "dialogue": "How do I move from one of these other?"
    },
    {
      "timestamp": "9:01",
      "speaker": "Andy",
      "dialogue": "How do you what?"
    },
    {
      "timestamp": "9:02",
      "speaker": "Nathan",
      "dialogue": "Move from one demo instance to the, to the normal?"
    },
    {
      "timestamp": "9:06",
      "speaker": "Andy",
      "dialogue": "You just change the URL. So, instead of demo dot sales, do xyz, do sales to get to our live\nproduction... or you can go to Okta, and click on, the tiles, but I never do that."
    },
    {
      "timestamp": "9:57",
      "speaker": "Nathan",
      "dialogue": "Seven."
    },
    {
      "timestamp": "10:47",
      "speaker": "Nathan",
      "dialogue": "It's annoying. Sorry."
    },
    {
      "timestamp": "10:49",
      "speaker": "Andy",
      "dialogue": "That's okay. It's not you. Yeah, it is. It's a bummer because he's the one that pushed the Friday\ncall to today. We're like, yeah, okay. Where again?"
    },
    {
      "timestamp": "11:34",
      "speaker": "Nathan",
      "dialogue": "What did you just say? Sorry for the confusion I sent the below earlier. I got pulled into another\nmeeting. Please let me know if below timing works for you."
    },
    {
      "timestamp": "11:46",
      "speaker": "Andy",
      "dialogue": "Am I on that?"
    },
    {
      "timestamp": "11:54",
      "speaker": "Andy",
      "dialogue": "I'm not seeing... a different time suggested?"
    },
    {
      "timestamp": "12:14",
      "speaker": "Nathan",
      "dialogue": "Yeah... I'm not sure what to see."
    },
    {
      "timestamp": "12:27",
      "speaker": "Andy",
      "dialogue": "Okay. Well, why don't you?"
    },
    {
      "timestamp": "12:30",
      "speaker": "Nathan",
      "dialogue": "And then,"
    },
    {
      "timestamp": "12:31",
      "speaker": "Andy",
      "dialogue": "no, I'm pretty open today."
    },
    {
      "timestamp": "12:34",
      "speaker": "Nathan",
      "dialogue": "All right."
    },
    {
      "timestamp": "12:35",
      "speaker": "Andy",
      "dialogue": "Well, kind of, but yeah, let me know. Let me know. I'm around."
    },
    {
      "timestamp": "12:38",
      "speaker": "Nathan",
      "dialogue": "All right. Sounds good."
    }
  ]
}