{
  "transcript": [
    {
      "timestamp": "0:00",
      "speaker": "Matt",
      "dialogue": "sorry, I had to fight the prompts for recordings but."
    },
    {
      "timestamp": "0:04",
      "speaker": "Nathan",
      "dialogue": "How are you, Matt?"
    },
    {
      "timestamp": "0:05",
      "speaker": "Matt",
      "dialogue": "I'm good. How are you doing well?"
    },
    {
      "timestamp": "0:08",
      "speaker": "Nathan",
      "dialogue": "Well, I'm doing well. You have a good weekend."
    },
    {
      "timestamp": "0:12",
      "speaker": "Matt",
      "dialogue": "Yeah, I couldn't use the longer one but it was good."
    },
    {
      "timestamp": "0:16",
      "speaker": "Nathan",
      "dialogue": "Here you are. I randomly have this Friday off. xyz gives us a once a quarter wellness day and\nthey always sneak up on us but I'm not gonna complain. So we've got a short week ahead for,\nfrom my side."
    },
    {
      "timestamp": "0:28",
      "speaker": "Matt",
      "dialogue": "Just rub it in. Okay? I see how it is. We're starting off on the wrong foot."
    },
    {
      "timestamp": "0:35",
      "speaker": "Matt",
      "dialogue": "Chattanooga Tennessee."
    },
    {
      "timestamp": "0:38",
      "speaker": "Nathan",
      "dialogue": "Very cool. Not to, I guess kind of inbetween where I came from. I was basically in Chicago for\nlast like five years and then about six months ago, I moved to Florida, so between, but I was\ngonna say awesome appreciate, you hopping on today, Matt. I know I grabbed a 30 minutes at\nthat. Still work for you?"
    },
    {
      "timestamp": "0:57",
      "speaker": "Matt",
      "dialogue": "Yeah, yeah, that's good."
    },
    {
      "timestamp": "0:59",
      "speaker": "Nathan",
      "dialogue": "Perfect. Well, what I was thinking for the call today and let me know if you think otherwise, but I\nwanna make sure that obviously you get the most. So I would love to start with like what I know\nabout abc based on some of the research that I've done, kind of have a few questions about\nhow you go to market, which will help me understand any goals you have as it pertains to ABM.\nAnd then ultimately like get what you need in terms of the information at xyz and how we can\nhelp based on some of the talking points that you want to cover. And then we'll just figure out\nwhat makes sense as far as next steps. Typically, that next step would be to see how the\nproduct works based on any use cases that we uncover. But what else were you hoping to\ncover today?"
    },
    {
      "timestamp": "1:36",
      "speaker": "Matt",
      "dialogue": "No, I think it's good. I mean, ABM... is it's something we need to continue advancing? We've\ndone some fun projects... and have always kind of operated under ABM approach but using\nadditional channels... as a priority force. So. Okay."
    },
    {
      "timestamp": "1:59",
      "speaker": "Nathan",
      "dialogue": "Okay, cool. Yeah. Let's let's break that down. I mean, you mentioned like we've been exploring\nways to just like advance, the strategy when you say we, is this like a company wide thing? Like\nwho are you talking about your ABM strategy with?"
    },
    {
      "timestamp": "2:11",
      "speaker": "Matt",
      "dialogue": "I mean, sales would be, my partner, it, but we're driving it. I mean, they approach it. Health care\nis unique in that if you're selling enterprise health care, you basically have 2000 ids that you're\ntargeting. And... so I mean, in essence, if you're gonna be an enterprise health care, you have\nto be doing ABM, but we've spread downstream somewhat into urgent care and in primary care,\nlarge, urgent care and primary care. And, that broadens the net a little bit, about 50 percent in\nprimary care is going to overlap with ids or health systems, urgent care, smaller segment... if\nyou have a larger footprint and urgent cares. But for the most part, independent urgent cares\ndominate the large side of that market. So anyway, long story short, we've always taken thatapproach from a selling perspective. When we market, we inevitably use channels that are\nassociated with industry publications, which puts us right squarely in with our ABM campaign.\nAnd then we've been using lassa... starting late last year just to target specifically for primary\ncare, physician leadership based on the npi. And then I've been exploring things like exact\ntarget and... a few other, you know, groups, in that vein that allow us, to advertise. And then\nwe've got some industry consulting kind of marketplace groups that give us some granularity\ninto that as well. So."
    },
    {
      "timestamp": "4:00",
      "speaker": "Nathan",
      "dialogue": "Okay. Got it. All right. So it's definitely, it's only something you've taken a stab at as far as like\ntrying to execute under ABM strategy. Most customers we work with that are in similar situations\nas yourself. Lawrence healthcare is one that comes to mind for us while they don't necessarily\ntarget the same exact audience."
    },
    {
      "timestamp": "4:19",
      "speaker": "Matt",
      "dialogue": "We used to be Florence. So I."
    },
    {
      "timestamp": "4:22",
      "speaker": "Nathan",
      "dialogue": "are, is the one I know because abc is now a company that's made up of three different\ncompanies, right?"
    },
    {
      "timestamp": "4:32",
      "speaker": "Matt",
      "dialogue": "Well, yeah. I, three different products is the best way to look at it that came from three different\ncompanies. So, yeah."
    },
    {
      "timestamp": "4:41",
      "speaker": "Nathan",
      "dialogue": "Got it. I do. I'm gonna show you the case study that we have on them because they're actually\none of the ones that just one published recently. I'll fit that over you right now. Sweet what I\nmean by that is like they have a set market that they know who they're going to be selling to as\nfar as like what that audience goes, going to look like. They don't target in a number of different\nindustries, like, you know, whether it's tech, manufacturing, health care, retail, whatever that\nmay be like, you have a set amount of targets. So, accounts that you need to target, it's not a\nmatter of who's going to be buying. It's a matter of when they're going to be buying. And that's\nessentially where we help similar customers in your shoes. When you think about like your ABM\nstrategy and like what you're looking to get out of it, are there like specific metrics that you're\nhoping that like an ABM strategy can help with? Like, for example?"
    },
    {
      "timestamp": "5:36",
      "speaker": "Matt",
      "dialogue": "Yeah."
    },
    {
      "timestamp": "5:36",
      "speaker": "Nathan",
      "dialogue": "Okay.5:37 | Matt\nYeah. I mean, we want to increase MQL, we want to increase engagement within those\naudiences. Before we even get an MQL. We want to decrease the cost of an MQL. I use Mac as\nmy internal Term for that, and then ultimately, we wanna decrease the cost of a."
    },
    {
      "timestamp": "5:57",
      "speaker": "Nathan",
      "dialogue": "Yep."
    },
    {
      "timestamp": "5:58",
      "speaker": "Matt",
      "dialogue": "So... so those would be, the courtiers areas from a marketing perspective, that I'm concerned\nefficiency of our marketing and increased velocity. So."
    },
    {
      "timestamp": "6:10",
      "speaker": "Nathan",
      "dialogue": "Yeah, it's funny. I mean, not a coincidence but those are two of the main three areas that we\nsolve for. And so I mean, six times we really help solve for one, it's like increasing your high\nquality pipeline. And so when you think about like increasing your MQL like we take that account\nbased approach. And just like when you think about your pipeline goals, like xyz is like position\nto help you because you are able to understand and identify who's actively shopping for abc.\nWe're able to help you reduce your go to market waste because we know the audiences that are\ninterested in and where we're able to identify where in the funnel, we can help reduce how much\nyou need to spend in order to convert on those leads and actually drive that brand awareness\nfrom what you were talking about the top of the funnel to, you know, as you go through the\nfunnel from, you know, unaware to aware to engage as you start to push them to your sales\nteam, as you think about your pipeline right now. And as the year what we in April already, I\ndon't know what type of fiscal year you're on, but... I'm imagining that with the recent round of\nfunding that there's likely a pretty aggressive revenue goal that your team has."
    },
    {
      "timestamp": "7:20",
      "speaker": "Matt",
      "dialogue": "Yeah, we do. I mean, I think if you're trying to back into budget, it's a tough place to be because\nI'm actually building it, and making an argument before because we, I came from zipnosis. And\nso the core marketing team came from zipnosis, Florence didn't have one giant, didn't have one.\nAnd... due to all the changes in the rebranding coming, we intentionally didn't do a significant\nbudget outside of saying, hey, we need to get the new website up. We need to get the new\nbrand built. And so our budget was really built around that. We're past that point. And so\nbasically, we're taking everything that we've done in the past and evaluating through that lens\ninto what extra do we need to do on top of that to basically restart what would have been the\nnormal budgeting process. So."
    },
    {
      "timestamp": "8:11",
      "speaker": "Nathan",
      "dialogue": "Sure. I think the reason I asked that question is it can help me understand where xyz is able to\nreally add value around that like aggressive revenue goal, but more so around the lines of like\ndo you have the pipeline needed right now in order to get to that revenue goal?8:32 | Matt\nNo, the pipe does not exist right now to hit that revenue goal. It is building with the right\nmomentum to hit the revenue goal. So, but I mean that comes from again, like the whole sales\nteam is being built right now. We had one person four months ago on a sales team. Now, we've\ngot five. We... yeah coming out of like they're coming out of Bright, which is where notes came\nfrom, which was a flaming dumpster fire. Our budgets got slashed in Q4 of 2022 and they\nstayed really Lean through 2023. So, for all practical purposes, we had some stuff in the pipe. It\nwas Lean and limited because of what was happening and it's been super charged in a lot of\nways but we're still actively building it. There's no way we're going to hit 2025 goals. We\nprobably we will hit 2024 goals. There's no way we're going to hit 2025 goals unless we get like\nrapidly ramped in Q3 and Q4. So."
    },
    {
      "timestamp": "9:42",
      "speaker": "Nathan",
      "dialogue": "How much of a priority is that, for your team right now?"
    },
    {
      "timestamp": "9:48",
      "speaker": "Matt",
      "dialogue": "I would say it's a bigger priority for me than it probably is everybody else in the company\nbecause we think that far out does that makes sense? I would say sales and customer success\nare really hyper focused on like what can we do right now with what we've got versus what are\nwe going to do to ramp? I mean, they're concerned about ramping into the future, but they're not\nthinking that far out so."
    },
    {
      "timestamp": "10:10",
      "speaker": "Nathan",
      "dialogue": "Got it. Okay. No, that's incredibly helpful like marketing channels that you're currently using\ntoday. I know you mentioned like a few different like tools and like things that you're using. Are\nyou like running paid ads? Like how are you driving traffic to your website right now?"
    },
    {
      "timestamp": "10:26",
      "speaker": "Matt",
      "dialogue": "Paid ads are not turned on really right now primarily because we just folded over websites and\nhave it fully set up in google Adwords. Again, we need, to get back to that but, we were waiting\nto see kind of where the dust settled. We still get a third site. We've got a fold in this month. Seo\nhas been historically, a Strong driver for us for around some key terms. But I'm expecting we've\ngot to make up some ground visit. Moss website was our best driver for that and it was losing\nbecause it was a slow site and we had limitations with it. So we've got to make up ground for\nthat. Plus we transitioned over to a new website. I don't know where we're gonna wash out for\nsure. There's gonna be some fall off. I think we've done a good job of trying to maintain it, but\nthere's gonna be something."
    },
    {
      "timestamp": "11:18",
      "speaker": "Nathan",
      "dialogue": "Yeah."
    },
    {
      "timestamp": "11:32",
      "speaker": "Nathan",
      "dialogue": "Okay. Yeah, I."
    },
    {
      "timestamp": "11:33",
      "speaker": "Matt",
      "dialogue": "Gonna do some webinars and stuff too, but I kind of bucket that under syndicated content. So."
    },
    {
      "timestamp": "11:38",
      "speaker": "Nathan",
      "dialogue": "Okay. Got it. I mean, as far as like what's working, it sounds like you've got some things that are\nin the pipe based on some of those channels that you're already using, you know, you're\ntargeting a few different audiences, expanding what was historically help care systems to know\nmore like urgent care, a couple of other types of different types of markets. You know, I have to\nimagine that like your priority of like wanting to be able to accomplish this ABM strategy and\nreally like, so for the pipeline in 2025 like getting everyone on the same page. I think what I can\nkind of give you a little bit of context on xyz is one how we can help you identify some quick\nwins so that it's not only helping you get to your 2025 pipeline goals but also put some kind of\nquick wins in the hands of your sales teams that I'm sure are pretty hungry for them with that\nthough. Like do you have any familiarity with xyz before I kind of hop into a little bit at?"
    },
    {
      "timestamp": "12:37",
      "speaker": "Matt",
      "dialogue": "I have a little bit. I think I poked that you all maybe a year ago as I was maybe further back than\nthat to be honest with you, but I know a little bit about you, so."
    },
    {
      "timestamp": "12:46",
      "speaker": "Nathan",
      "dialogue": "All right. Well, I can give you a little bit of a run down here if that's okay. And I think this slide is a\nreally good job of like kind of understanding the basis, of xyz here. So why companies like\nFlorence, healthcare, marathon hall, a ton of different like healthcare companies that we work\nwith, move to six sense because they only really know and have been able to capture what's in\ntheir known funnel. So, this is someone that requests a demo on your page. They attend a\nwebinar. It's a very small portion of your buyer journey. They might be tracked in your CRM\nbecause they replied to an e-mail it's only about 30 percent in shrinking. But xyz does uncover\nthe 70 percent of the buyer journey that takes place before someone submits a form. So\nimagine that you're shopping for, I don't know, nice for like running shoes like you're likely going\nto be going on nike. You're gonna be going into ditas, Brooks hoa, whatever that may be. And\nyou're gonna be doing this before you walk into a store and actually buy that. So what we do is\nwe uncover more accurately than anyone in the space is what they do before they submit a\nform. So, these are companies that are browsing your website, browsing, your competitors,\nreview sites. They're going on your demo page. And there are people that are in active buying\ncycles. We're going to buy something whether it's you or not... where companies tell us they\nfind so much value. Is that before xyz, they were frankly coming in late to deals like rfps were\ngiven out just because their CFO told them. Let's add one more vendor to the RFP for the due\ndiligence. Whereas now we're targeting those accounts. First, you have influence over thosedeals and the criteria. And most importantly, like not only you but like your sales team are\nmissing out our deals that were whinnable, no surprise. Like 70 percent of deals are won by the\nfirst vendor that engages in that opportunity. Another use case to think about, is your customer\nbase? Like I'm assuming your services are reoccurring?"
    },
    {
      "timestamp": "14:53",
      "speaker": "Matt",
      "dialogue": "As in like continue, yeah, yeah, yeah, stuff. Yeah."
    },
    {
      "timestamp": "14:59",
      "speaker": "Nathan",
      "dialogue": "Yeah. So huge use case there as well as like driving upsell reducing churn for your team that is\nhandling your customer base. So it's our ability to identify who's doing that research before they\nactually submit a form. I think the best way to put it is it's a lot easier to generate revenue when,\nyou know, who's shopping for your solution?"
    },
    {
      "timestamp": "15:22",
      "speaker": "Matt",
      "dialogue": "Yep."
    },
    {
      "timestamp": "15:23",
      "speaker": "Nathan",
      "dialogue": "Are you going to do xyz as a kind of a solution here?"
    },
    {
      "timestamp": "15:28",
      "speaker": "Matt",
      "dialogue": "Yeah, no, 100 percent. I mean, like I said, what we're doing with last. So what we're exploring\nwith exact target falls in line, with this, so."
    },
    {
      "timestamp": "15:36",
      "speaker": "Nathan",
      "dialogue": "And I'm actually not familiar with LAS, what are you doing with that as?"
    },
    {
      "timestamp": "15:40",
      "speaker": "Matt",
      "dialogue": "So marketing, they're really hyper focused in healthcare. Okay. So they've got a couple of\ndifferent avenues. But the one we're using is npi targeting. So we'll get a list of physician leaders\nand organizations, and then I will match them up because there's a lot of like overlapping org\nstructure. So you may be a physician leader in the xyz business unit that's actually under this\nhealth system or this large provider group. And so, I, a, I, I've built a database to match them all\nup and say, hey, these are how these all roll up into it. These are affiliated groups. These are\nhow many people interacted with our ads from the same organization. And the downside of that\nis that it only covers physician leaders. I can't get that granularity out of non physician leaders.\nSo you've got plenty of people that didn't get an MD that leaders in health organizations. So."
    },
    {
      "timestamp": "16:37",
      "speaker": "Nathan",
      "dialogue": "How many people are typically in a buying committee for a abc?"
    },
    {
      "timestamp": "16:43",
      "speaker": "Matt",
      "dialogue": "Health system would be like 20 primary care group three or four for... you know, urgent caregroup. You can two three, four. Something like that. There's a lot of stakeholders that point on\nthe health system side of it."
    },
    {
      "timestamp": "17:02",
      "speaker": "Nathan",
      "dialogue": "Yeah. So."
    },
    {
      "timestamp": "17:02",
      "speaker": "Matt",
      "dialogue": "Those sessions."
    },
    {
      "timestamp": "17:04",
      "speaker": "Nathan",
      "dialogue": "I can imagine frankly like between our segments here, ours is double digits as well as far as the\npeople needed to get buy in order, to get a deal done. And it's no surprise. It's the average\nbuying committee across most of the industries that we, work with if not all, which is why they\ntake this account based approach because it's not one person making a decision in a vacuum.\nI'm sure the same way you're having this conversation with me today, this account based\nstrategy is something that you've talked about with your team before. Likely if we're going to\ncontinue the conversation, there's gonna be other people involved. So how do we take this\napproach? It's not a lead specific approach but an account based approach. I'm also imagining\nthat with that larger buying committee, those deal sizes, are gonna be a little bit bigger."
    },
    {
      "timestamp": "17:48",
      "speaker": "Matt",
      "dialogue": "Yeah. Well, it depends honestly like we've sold some of our biggest deals outside of health\nsystems, but it more closely you get more closely aligned with their business model. It that way\nbecause you're at the clinic level. If you've got 200 clinics, you're a pretty large group. And then\nwhat happens at the health system level, they have a hard time migrating down into the clinic\nlevel. So it takes a while to your initial contract, is good, but you have to, you have to land and\nexpand to get the same size volume out of it. So, I."
    },
    {
      "timestamp": "18:20",
      "speaker": "Nathan",
      "dialogue": "okay. So there's a couple of different use cases. There's one where you can get a bigger deal\nupfront there's one where you can land. But with all of the different clinics that there's a huge\nopportunity for driving crosssell within that like what is, I guess I don't know if there's so much\nhuge range or like an average deal size for you right now?"
    },
    {
      "timestamp": "18:42",
      "speaker": "Matt",
      "dialogue": "I mean, it's growing because now we've got three products versus one. I mean, historically\nwhere we're looking at, you know, 152 102 100,000 dollar deal. Giants average deal that we\nacquired was smaller than that. Florence average deal didn't really exist because they were the\nyoungest product, but it probably has the largest potential for a larger deal out of the gate, but\nwe're seeing things creep up to five plus now. So."
    },
    {
      "timestamp": "19:08",
      "speaker": "Nathan",
      "dialogue": "Okay. And I mean that's a fairly sizable deal size for your team. How long does it take to close\nthat kind of deal?19:17 | Matt\nHealth care man? It can be nine months."
    },
    {
      "timestamp": "19:22",
      "speaker": "Nathan",
      "dialogue": "Yeah. I mean, in that case, I think it kind of leads me to my next slide that I wanted to show you\nis that... what we're able to do and like how we are able to do this for these healthcare\ncompanies that we work with, who sell to, you know, specific target audiences is that one will\ntake your first party data. So this is your web activity. So anyone that hits your website before\nthey fill out a form, we capture them and that's any page on your website. Do you have anything\nlike that to capture that today?"
    },
    {
      "timestamp": "19:55",
      "speaker": "Matt",
      "dialogue": "Yeah."
    },
    {
      "timestamp": "19:57",
      "speaker": "Nathan",
      "dialogue": "What are you, what are you using for that today?"
    },
    {
      "timestamp": "20:00",
      "speaker": "Matt",
      "dialogue": "For web activity to capture who it is or to capture forms, I guess it's a better question."
    },
    {
      "timestamp": "20:04",
      "speaker": "Nathan",
      "dialogue": "To capture what accounts, are on what pages of your website?"
    },
    {
      "timestamp": "20:08",
      "speaker": "Matt",
      "dialogue": "No, I almost have signed up for something comparable to that with lassa. And I've almost signed\nup for something comparable with that with exact target, but I have not."
    },
    {
      "timestamp": "20:19",
      "speaker": "Nathan",
      "dialogue": "Okay. So we're able to tell you again more accurately. And this is validated by like third party\nreports for sir Gardner who's doing that research on your site. So we de anonymize who's doing\nthat research, map that back to an account better than again, any other vendor, that is doing\nthat first party research. Well, we'll also take is third party data. So that's that intent keyword\nresearch. And you're talking about those seo keywords that you're already using today to drive\npeople, we are able to scrape the web to see who's looking up an unlimited amount of relevant\nkeywords and that's across a network of 2,000,000 bab publisher sites. So think keywords like\ncare enablement, intake, triage, and routing, we can actually tell you which of those accounts\nare doing that research. And as well as layer on that research with the first party data, we can\ntell you whose researching your competitors, all of which this allows you to do is more like from\nhere, better advertise with this information, better use this for your marketing campaigns so that\nyou can reduce the amount of spend it takes to increase the pipeline gap that you currently\nhave today? What we're able to do is actually leverage different like technographic information.\nSo, are there any like types of technologies that ideal customer would also be having that would\nmake them a good fit for you?21:49 | Matt\nAny types of technology that our customers would also be interested in? Is that the question?"
    },
    {
      "timestamp": "21:53",
      "speaker": "Nathan",
      "dialogue": "No. So like let's say for us, for example, like if a customer is using like Hubspot, Salesforce,\nthat would mean they're good tech fit like for you, is there any type of tech that would make\nthem a good fit?"
    },
    {
      "timestamp": "22:06",
      "speaker": "Matt",
      "dialogue": "I mean... yes... but it's more gonna be organizations that are competitive with us. It's not gonna\nbe so much... synergistic technologies like hopspot, just because I mean, I could say anybody\nthat's on ethic, well, that's like 80 percent of the market like in terms of an ehr. And then, so then\nit goes down to like, are you using competitive solutions that we can consolidate under one\ncontract because we have a breath whereas most of our competitors are side load into single\npoint solutions. So."
    },
    {
      "timestamp": "22:44",
      "speaker": "Nathan",
      "dialogue": "Yeah. And, and the idea behind xyz is that we can help identify that for you whether that's by our\ntechnographic information or the third party data that they're researching off of your site, we can\ndo."
    },
    {
      "timestamp": "22:55",
      "speaker": "Matt",
      "dialogue": "It'd be interesting to be interesting to see, how well you do in a specialized market like ours\nbecause we're not dealing with like Salesforce or Hubspot or we're not, we're dealing with like\nobscure health tech that may have like 30 customers. And when I say like 30 logos... so you\nwould have to be like, do you know, hiro or orbit or all these other obscure things that I don't\nknow, you may not, or Bright MD who have like 25 customers that just implode. So like that,\nthat'll be the hard part for you all. As if you've got that granularity into a really specialized\nindustry like healthcare."
    },
    {
      "timestamp": "23:35",
      "speaker": "Nathan",
      "dialogue": "Yeah. I mean, what we can do is take a look obviously... our ability to track that."
    },
    {
      "timestamp": "23:43",
      "speaker": "Matt",
      "dialogue": "And if you're using something like built with you might catch some of it to script that info. It's it's\nhard to say so."
    },
    {
      "timestamp": "23:50",
      "speaker": "Nathan",
      "dialogue": "Yeah... we, I mean, I'm happy if you want to send over a quick list of just like those other\ntechnologies that you were saying. I can see like our ability to track that just from like a\ntechnographic information rather than third party. I can also get through kind of where we would\nbe able to really validate the intent for you to make sure that it's going to be valuable for you in\norder to get to some of those goals. And then as we're thinking about like prioritizing thoseaccounts based on the buying journey, we can better identify where these accounts are based\non the research and the intent that they're showing. So maybe we're seeing accounts that are\ndoing research on things that you solve for, but not necessarily coming to your site. We can use\nour low spend customer acquisition campaigns on those as they move down the funnel. They're\nstarting to show more engagement. They are coming to our site. Maybe we can start to push\nLinkedin ads or whatever."
    },
    {
      "timestamp": "24:44",
      "speaker": "Matt",
      "dialogue": "What is low spend customer acquisition campaign to mean for you?"
    },
    {
      "timestamp": "24:47",
      "speaker": "Nathan",
      "dialogue": "It's like your Display, your classic Display, maybe something like that."
    },
    {
      "timestamp": "24:52",
      "speaker": "Matt",
      "dialogue": "So you're remarketing at that point Retargeting, okay. Yeah."
    },
    {
      "timestamp": "24:56",
      "speaker": "Nathan",
      "dialogue": "Sure."
    },
    {
      "timestamp": "24:57",
      "speaker": "Matt",
      "dialogue": "That's fair. Yeah. So, but Retargeting with me understanding who they are to some degree, at\nleast what organisations they're with versus me Retargeting with google ads and hope they\ncome back through and identify who they are."
    },
    {
      "timestamp": "25:11",
      "speaker": "Nathan",
      "dialogue": "Exactly like for example, let's say I'm a physician leader and six sense is just so happens to be a\nhealthcare organization. Like your team is trying to target, you know, xyz and they're seeing\nactivity in Miami, Florida. I'm one of three folks in Miami that work at xyz. Not only can we cover\nthe account hitting your website, but we also show you hey, this is coming from Miami. There's\nonly three people there, probably a good indication of doing who's doing that research."
    },
    {
      "timestamp": "25:39",
      "speaker": "Matt",
      "dialogue": "Yeah, I don't know, I guess again back in an ID and land that are all situated in like, you know,\nbig the markets that are in which is funny and they'll have like 13,000 employees, but... we can\nget down to, you know, identifying potentially, the director level or above more than I, our tech,\nbut yeah."
    },
    {
      "timestamp": "26:01",
      "speaker": "Nathan",
      "dialogue": "The way I say it's like xyz is a compass like we're not a silver bullet but what we are like the\nmost accurate compass. So being able to tell you who's doing that research, you know, it\nsounds like I was going to say map. There's a couple of areas that like your team wants to be\nable to improve like most of which being that like increase, in pipeline for your revenue goals as\nwell as like some of that reduction and go to market waste. Like, I know this is something thatyou obviously responded to one of my e-mail is there any like timeline in which you want to be\nable to execute like an ABM strategy with like some data points?"
    },
    {
      "timestamp": "26:36",
      "speaker": "Matt",
      "dialogue": "I mean, look, I told you I'm exploring and, I'm close on a number of different things of doing\nsomething like this. Where it lands on our priority list is tougher to say. I'll probably get some\nmore understanding on that... in the next month or so. It's just... it's a matter of understanding\ncosts. And then looking at the way that we've traditionally been doing things, and saying like, is\nthis gonna be more efficient and more effective... or is it do what you've been doing and this...\nor do a little less of what you've been doing in this? You know, I've got to figure that out. So I\nhave no idea what your cost is. I do know what exact target as I do know what last says... and\nso... I think that's what it gets down to is like, you know, truly what does it do? And then how are\nyou seeing your customers leverage? It? Are you seeing BDRs get into it? Or, or you're seeing\nthe sales team actually start doing progressive outreach on that organization. When I say sales\nteam like, the exacts the sales execs versus the lower level grunt. We do not have an internal\nbelief in BDRs anymore. So that's an interesting dynamic that I've got to navigate... sales may\nor may not want to get involved early enough to start figuring out or maybe they will, it's one of\nthose tough things. And so then if they're not how much does that put on the marketing team in\nterms of doing direct outreach and making it look like it's coming from a salesperson. I've got to\nbounce those things. So."
    },
    {
      "timestamp": "28:24",
      "speaker": "Nathan",
      "dialogue": "Yeah. Well, there's different flavors to what xyz can package for you as far as like what a scope\nwould be based on what I've heard from you, it sounds like you'd want to use this as like a\nmarketing tool right now to be able to take this data that we're able to capture on your target\naudience and your market, who's doing that research and be able to run effective marketing\ncampaigns that you can increase the quality of your pipeline through that. And that's the core\nuse case, of six sense is where we started. And honestly our bread and butter, we have specific\nareas of our product that is directed towards sales. So if you're familiar with like a Zoom info?"
    },
    {
      "timestamp": "29:01",
      "speaker": "Matt",
      "dialogue": "Yeah."
    },
    {
      "timestamp": "29:02",
      "speaker": "Nathan",
      "dialogue": "Are you using anything like that today?"
    },
    {
      "timestamp": "29:05",
      "speaker": "Matt",
      "dialogue": "We use defendative health care which is hyper focused, in health care that's probably the\ndefinitive healthcare database."
    },
    {
      "timestamp": "29:14",
      "speaker": "Nathan",
      "dialogue": "So we have a competing product to like the Zoom infos of the world where we can give you like\nemails phone numbers, all while providing that same level intent to your sales team. I think ifwe're going to schedule a demo, I'd love to walk you through like the marketing use case and\nlike how we can help like accomplish these."
    },
    {
      "timestamp": "29:33",
      "speaker": "Matt",
      "dialogue": "It would be interesting to see, the emails and phone number side of it. Inevitably, there have\nbeen times where me personally, I've taken it down that path to try to actually, I was trying to get\nour BDRs functioning because our prior sales leadership wasn't... effectively managing them.\nSo I a, I was literally like building lists running through Zoom, running through a, running through\nhunting, running them through via pacing all this stuff together. Yeah. I, was, is a great tool for\ngetting emails and phones Hunter dot IO is to, but I mean, it's not sustainable for me. I, a, I can't\ndo it back then. You know, we had Lean budgets. So I was getting creative on what I can do.\nAnd that seems like over a year ago and we found success in doing it but, it wasn't scalable\nbecause it was me just like running through stuff. So."
    },
    {
      "timestamp": "30:35",
      "speaker": "Nathan",
      "dialogue": "Okay. So how about this? I was thinking for next call that we could keep, we can get into the\ndemo. We can keep it high level. I can show you kind of the marketing flavor and the sales\nflavor in the same call. And then I like as a follow up like we can do like a deeper dive into like\nhow you'd run specific like ads or like how you'd like report on things. And like I can show you a\nlot of that like high level demo. In that first call, what I'll say is like when you think about\ndifferentiation from some of these other tools that you're using if you're looking to increase\npipeline like truly like there's no one else that is able to identify more revenue opportunities\nbecause of the de, anonymization, so I can walk through like how we're able to do that. And\nthen we can discuss pricing as well on that conversation. Assuming that again, you do see a fit.\nYeah, my question for you before we pull up some calendars here like let's."
    },
    {
      "timestamp": "31:28",
      "speaker": "Matt",
      "dialogue": "say."
    },
    {
      "timestamp": "31:29",
      "speaker": "Nathan",
      "dialogue": "You do see what you want to see in like a demo. And this looks like awesome to you. Like who\nwould have an opinion? And, and like kind of signing off on this as well? Is this like Justin would\nhave some is?"
    },
    {
      "timestamp": "31:41",
      "speaker": "Matt",
      "dialogue": "No, he O, he wouldn't be involved with that anymore. He's moved into partnerships. Yeah. I\nmean, I would say right now, the sales team is in a growth stage and they're more concerned\nabout blocking and tackling than strategy. So I think they'll come a point where maybe, if it\ncrosses that threshold, we'll pull other people into it. But to your point, like right now it's more\nmarketing looking further down the road and what we're gonna do and it needs to get past that\npoint. And then I've got to evaluate the cost on it. And then what provides us more scalability\nand expansion with the tool sets? Because like I said, I'm already looking at a couple of options\nfor it. And because we're thinking down that road. So, I think broader than marketing. I mean,\nI've got another project I'm working on that I is going to impact product. Eventually, the productwe're going to end up selecting is probably gonna shade towards to meet future needs of the\nproduct team, which means I may sacrifice some stuff for marketing on the front side, but I think\nmore broadly than just my specific use case on things. So."
    },
    {
      "timestamp": "32:52",
      "speaker": "Nathan",
      "dialogue": "Okay. Sorry, the last point that you just brought up, you're working on another project with\nproduct?"
    },
    {
      "timestamp": "32:57",
      "speaker": "Matt",
      "dialogue": "The, yeah, it doesn't it's a marketing tool. It'll end, it'll end up being used probably by product in\na couple of years when they start realizing what they can do with drive user adoption. So, my\nImmediate use case is what I said for mqls and decreasing cost. But I will be thinking about the\noperational side, of sales and, what potential tools we would use and how it gets us to where we\nneed to be in the future even if they're not ready to adopt something like that."
    },
    {
      "timestamp": "33:27",
      "speaker": "Nathan",
      "dialogue": "Okay, great. And then, sorry."
    },
    {
      "timestamp": "33:29",
      "speaker": "Matt",
      "dialogue": "Because more than likely they're not gonna say yes in the up for X amount of cost that I've got\nto overcome right now. Yeah."
    },
    {
      "timestamp": "33:38",
      "speaker": "Nathan",
      "dialogue": "Cool. Let's get some time scheduled. Like I said, I don't want to flex again, but I am off on\nFriday, but we've got time."
    },
    {
      "timestamp": "33:49",
      "speaker": "Matt",
      "dialogue": "Slip you off. I'm just kidding."
    },
    {
      "timestamp": "33:53",
      "speaker": "Nathan",
      "dialogue": "I'll probably end up working. Who am I getting? I got time on Thursday or... honestly could\nprobably turn it on... if that works for you."
    },
    {
      "timestamp": "34:08",
      "speaker": "Matt",
      "dialogue": "I could do three o'clock Thursday. Would that work?"
    },
    {
      "timestamp": "34:13",
      "speaker": "Nathan",
      "dialogue": "Three o'clock and that is eastern, right. Yeah, awesome. Let's do it. I'll throw some time on for\nThursday. I'll get that over to you. I know you mentioned marketing. This is gonna be that first. Is\nthere anyone else in the marketing side that like you want their eyes on it?"
    },
    {
      "timestamp": "34:29",
      "speaker": "Matt",
      "dialogue": "I might pull Trevor in from my team. Yeah, I'll probably pull Trevor in because he's been on some\nof the other conversations we've been looking at. So.34:40 | Nathan\nLet's do it. I'll send that invite over and then we can talk through. Again, there is the\nplatform. Let's do a deep dive, make sure we solve where, you care about anything comes\nup in the\nmeantime, don't hesitate to reach out just so that I can come prepared with some like talking\npoints. So that like help you differentiate the tools that you're looking at, are exact target\nand,"
    },
    {
      "timestamp": "35:02",
      "speaker": "Matt",
      "dialogue": "yeah. And let me pull this up just so you know... yeah, last. So as got a couple of things ACV\nbought them a few years ago or maybe a year ago. Our tech target is what it is. Tech target. The\nexact target is the old Salesforce?"
    },
    {
      "timestamp": "35:28",
      "speaker": "Nathan",
      "dialogue": "Yeah. What I was thinking, I was saying?"
    },
    {
      "timestamp": "35:30",
      "speaker": "Matt",
      "dialogue": "Yeah, tech target."
    },
    {
      "timestamp": "35:32",
      "speaker": "Nathan",
      "dialogue": "Okay. That sounds functional. Yeah. And as, yeah... all right, cool. This is great. I appreciate the\ntime Matt, I'm pumped to meet again on Thursday. Do you wanna forward off the e-mail, to\nTrevor or do you wanna send that over so I can get him on?"
    },
    {
      "timestamp": "35:52",
      "speaker": "Matt",
      "dialogue": "I'll forward it to him. It's fun. Yeah."
    },
    {
      "timestamp": "35:56",
      "speaker": "Nathan",
      "dialogue": "Perfect. Well, appreciate the time man, looking forward to Thursday."
    },
    {
      "timestamp": "36:00",
      "speaker": "Matt",
      "dialogue": "And."
    },
    {
      "timestamp": "36:01",
      "speaker": "Nathan",
      "dialogue": "I'll send a follow up after this with a few resources. It's like maybe another case study that can\nhelp with health care, so."
    },
    {
      "timestamp": "36:07",
      "speaker": "Matt",
      "dialogue": "I am also interested in... you mentioned it as a by line on this one. I am interested in customer\nexpansion and retention. We, we had turnover in, our customer success leadership on two of\nour business units. Didn't really have customer success on top of that. So we got a gap, in\nknowledge of some of our customers to the granular level that we needed. And I would love tosurface risks earlier, and expansion opportunities so that they can be more proactive. They're\njust building out an account management team to tack on that too. So again, I'm thinking further\nahead than they are, they won't even be willing to probably entertain a conversation, but it's\nsomething that's important, for what I think we can bring to the table. So."
    },
    {
      "timestamp": "36:55",
      "speaker": "Nathan",
      "dialogue": "Yeah. I mean, if it can solidify the business case for you, it definitely helps not like it's an\nadditional cost to know what your customers are looking up for us. So, yeah."
    },
    {
      "timestamp": "37:05",
      "speaker": "Matt",
      "dialogue": "I'm just saying case studies and that would be cool. So, yeah."
    },
    {
      "timestamp": "37:07",
      "speaker": "Nathan",
      "dialogue": "Yeah. Awesome. Well, Matt, appreciate the time we'll talk on Thursday and I'll send you a follow\nup pretty quickly after this."
    },
    {
      "timestamp": "37:14",
      "speaker": "Matt",
      "dialogue": "Cool. Thanks."
    },
    {
      "timestamp": "37:15",
      "speaker": "Nathan",
      "dialogue": "Take care, man. Bye bye."
    }
  ]
}