{
  "transcript": [
    {
      "timestamp": "0:00",
      "speaker": "Matt",
      "dialogue": "hey."
    },
    {
      "timestamp": "0:01",
      "speaker": "Nathan",
      "dialogue": "Matt. How are you?"
    },
    {
      "timestamp": "0:03",
      "speaker": "Matt",
      "dialogue": "I'm good. Brian didn't accept this, it looks like, but we see."
    },
    {
      "timestamp": "0:14",
      "speaker": "Matt",
      "dialogue": "Seeing if he's double booked a."
    },
    {
      "timestamp": "0:17",
      "speaker": "Nathan",
      "dialogue": "All good. Let me know."
    },
    {
      "timestamp": "0:21",
      "speaker": "Matt",
      "dialogue": "Should be good. I just give him a minute, see if he's gonna join. Sounds good?"
    },
    {
      "timestamp": "0:26",
      "speaker": "Nathan",
      "dialogue": "How are you been?"
    },
    {
      "timestamp": "0:28",
      "speaker": "Matt",
      "dialogue": "Good. Pretty good.0:32 | Nathan\nNo."
    },
    {
      "timestamp": "0:32",
      "speaker": "Matt",
      "dialogue": "Yeah."
    },
    {
      "timestamp": "0:34",
      "speaker": "Nathan",
      "dialogue": "Up to anything fun recently?"
    },
    {
      "timestamp": "0:36",
      "speaker": "Matt",
      "dialogue": "No man. I've been like trying to get over so something for two weeks and had to get a Phoenix\nin the middle of it... sound like in my third weekend is still just kind of hanging around."
    },
    {
      "timestamp": "0:48",
      "speaker": "Nathan",
      "dialogue": "Like one?"
    },
    {
      "timestamp": "0:50",
      "speaker": "Matt",
      "dialogue": "Yeah, some sort of like upper restaurant nonsense."
    },
    {
      "timestamp": "0:54",
      "speaker": "Nathan",
      "dialogue": "It should, I feel like I was in that same boat like a couple of weeks back where I was just like\nthree weeks of just like lingering. Yeah, I've gotten over the hump but I feel for you."
    },
    {
      "timestamp": "1:09",
      "speaker": "Matt",
      "dialogue": "Yeah, I'm just running down at this point, but it is what it is. It's not the wise COVID. It wasn't\nbad. So I went out."
    },
    {
      "timestamp": "1:18",
      "speaker": "Nathan",
      "dialogue": "Yeah, I, you know, like I said, say, working from home makes it a little bit more tolerable... not\nneeding to go into the office every day, forget what it's like to just like be like minorly sick and\nhaving, to go in every day really took it out of you."
    },
    {
      "timestamp": "1:37",
      "speaker": "Matt",
      "dialogue": "Well, yeah. And then the funny thing, is like now, everybody like, why did you come into the\noffice?"
    },
    {
      "timestamp": "1:41",
      "speaker": "Nathan",
      "dialogue": "It."
    },
    {
      "timestamp": "1:42",
      "speaker": "Matt",
      "dialogue": "when I was back in today, it was like your badge like I'm working through it. Yeah."
    },
    {
      "timestamp": "1:56",
      "speaker": "Matt",
      "dialogue": "A, Brian. Awesome. Hey, Brian... we can't hear you. Yeah... I had the same problem, with Zoom\nwhere like it was picking up, my, on my headphones, but then trying to play through my monitor\nand like I had to go into system settings and adjust it."
    },
    {
      "timestamp": "2:22",
      "speaker": "Nathan",
      "dialogue": "Give another 30 seconds here."
    },
    {
      "timestamp": "2:27",
      "speaker": "Matt",
      "dialogue": "Better to do an hour, right? Instead of getting on a call with a customer. Yeah."
    },
    {
      "timestamp": "2:30",
      "speaker": "Nathan",
      "dialogue": "Yeah, exactly."
    },
    {
      "timestamp": "2:35",
      "speaker": "Brian",
      "dialogue": "Can you hear me now?"
    },
    {
      "timestamp": "2:37",
      "speaker": "Matt",
      "dialogue": "Yeah."
    },
    {
      "timestamp": "2:38",
      "speaker": "Nathan",
      "dialogue": "Much better."
    },
    {
      "timestamp": "2:39",
      "speaker": "Matt",
      "dialogue": "Yeah."
    },
    {
      "timestamp": "2:39",
      "speaker": "Brian",
      "dialogue": "Same same exact thing. It a, it was on my Mac books Mike, but the audio was on my airpods.\nWeird."
    },
    {
      "timestamp": "2:49",
      "speaker": "Matt",
      "dialogue": "Yeah, but the Mike, the, I, yeah, it's just the Mike on your desktop, want picking up or\nsomething? Yeah, I don't know what happened like I rebooted my computer and everything has\njust been kind of walky. So."
    },
    {
      "timestamp": "2:58",
      "speaker": "Brian",
      "dialogue": "Yeah, I just updated Zoom, so, it might have been tied to that."
    },
    {
      "timestamp": "3:03",
      "speaker": "Nathan",
      "dialogue": "Bizarre, but Brian, great to meet you."
    },
    {
      "timestamp": "3:47",
      "speaker": "Nathan",
      "dialogue": "That's great. Thanks, Matt. Honestly, like I was, first question I was gonna ask was around what\nyou're looking to get out of today's? Call. And, and with that, like what I was thinking just by the\nway, I know we got a 30 minutes. You both have a hard stop at the 30 minute mark."
    },
    {
      "timestamp": "4:02",
      "speaker": "Brian",
      "dialogue": "I have an internal call, I can move if needed, but I don't know what you have."
    },
    {
      "timestamp": "4:06",
      "speaker": "Matt",
      "dialogue": "Yeah, I've got some more room. So."
    },
    {
      "timestamp": "4:08",
      "speaker": "Nathan",
      "dialogue": "Okay, cool. I should be able to run like a couple of minutes after just in case we need to. I just\nwanted to make sure that, yeah, I appreciate it, Matt, Brian, just by way of a quick introduction,\nyou know, at six, sons have been here for about a year, and been working with Matt just a\ncouple of conversations as far as how we can power is, you know, marketing team with, some\nvaluable data points as far as like the intent that we're able to provide, you know, as it pertains\nto today's, call, what I was thinking would be a good agenda was really giving you some insight\nto how xyz a, what sounds like help your sales team more effectively prioritize like who they\nshould be targeting when they're prospecting, and in turn like get into more deals faster. But\nBrian, I'd be curious to hear from you. Like what exactly are you hoping to get out of today's?\nCall?"
    },
    {
      "timestamp": "4:53",
      "speaker": "Brian",
      "dialogue": "Yeah. So I have a few questions that I can walk through. You know, I think just Matt mentioned\nit. I just initially had requested Zoom info. So talking through maybe just some of the\ndifferentiators there, understanding why, you know, I saw the deck why folks have slipped\nover... and then a couple of just maybe talking through a couple of the features that were on\nthat like on the bottom of the slide two there. Just so just understanding what to what those do\nand if they are kind of unique to xyz or if they're you know, pretty standard in the market. It's\nquick rundown of what I'm looking for there."
    },
    {
      "timestamp": "5:41",
      "speaker": "Nathan",
      "dialogue": "Yeah. That's great. And, and you just started like a month or?"
    },
    {
      "timestamp": "5:45",
      "speaker": "Brian",
      "dialogue": "I did. I'm about a month and a half in. I got initiated at ata and Phoenix last week. So Matt andI shared a nice sakta pie and it's a good time."
    },
    {
      "timestamp": "5:59",
      "speaker": "Matt",
      "dialogue": "Yeah. We do a little bit of water boarding and an amazing."
    },
    {
      "timestamp": "6:04",
      "speaker": "Nathan",
      "dialogue": "Wow. Well, I'm glad you survived in a minute to the other side, but congrats blade. Congrats on\nthe new role. Have you used Zoom info in the past?"
    },
    {
      "timestamp": "6:13",
      "speaker": "Brian",
      "dialogue": "I didn't so I came from amwell, I think there are Zoom info customer and we had a team, that\nwould use it. I probably used it through integration in Salesforce, but I didn't actually use, the ui\non it at all."
    },
    {
      "timestamp": "6:29",
      "speaker": "Nathan",
      "dialogue": "Okay, cool. Sounds good. Helpful. Are you looking at this as like a, you know, mentioned Matt\nas a replacement to definitive health care or a compliment?"
    },
    {
      "timestamp": "6:40",
      "speaker": "Matt",
      "dialogue": "Compliment. I think it's, the best way to look at it. I do, I haven't found anybody that is as\nexpansive, in healthcare is definitive, but definitive is kind of short on contact info. So."
    },
    {
      "timestamp": "6:52",
      "speaker": "Nathan",
      "dialogue": "Well, good. Yeah, that's helpful to know."
    },
    {
      "timestamp": "6:54",
      "speaker": "Matt",
      "dialogue": "It's so expansive in the sense of entire org structure, but especially at the leadership levels then\nbeing able to get down into the providers. So it gives you a lot of info I think on the org and then\ndives into some of the claims based data that's really helpful in the sales process. But I, it's just\nthe contact info side of it's quite tranquily shallow. So."
    },
    {
      "timestamp": "7:17",
      "speaker": "Brian",
      "dialogue": "Yeah, I totally agree. I think the clinical in claims data is what I gain most out of definitive there."
    },
    {
      "timestamp": "7:26",
      "speaker": "Nathan",
      "dialogue": "Cool. That's helpful context. Yeah. Well, I guess just to just kind of start off, you know, Matt and I\nlike I said, we've had a few conversations, you know, kind of building out your go to market\nstrategy, seeing ABM playing a crucial role in that. And what I understand, obviously you target\na pretty specific addressable market, you know, longer deal cycles and healthcare, bigger\nbuying committees, and just like a lack of visibility like within that addressable market of like\nwho's actually shopping for a solution like abc but kind of like, the larger initiative here is that\nlike pipeline is what's going to like matter most is, you know, if nothing changes, like how are we\ngoing to make sure that like your team is in a position to like hit aggressive future revenue\ntargets? So everything that we've talked to you up to this date is like supporting that initiative,Brian, would you say that this is kind of in that same vein of like how, what we're looking to\naccomplish here?"
    },
    {
      "timestamp": "8:18",
      "speaker": "Brian",
      "dialogue": "Yeah. And I think that was to, the bottom three, you know, bullets on that slide, those bottom\nthree graphics. So understanding, you know, outside of contact info, which I also had a question\nabout those numbers, you know, what can we, what's going to help us sell, right? Like is there\nany anything in there that, you know, whether it's what people are, you know, keywords or all\nthat? I'd like to understand. I've never really used anything like that. So understanding what that\ndoes would be great."
    },
    {
      "timestamp": "8:48",
      "speaker": "Nathan",
      "dialogue": "Cool. Well, in which case, I'll go through two really quick steps like what the ui looks like, and\nlike how we actually action the data that we're gonna provide. So just to give you some insight\nand I know like how xyz helps, I know Matt bear with me because I know I've covered these two\nwith you but I think it does good to do a good job of kind of like giving insight into like how xyz\ndifferentiates, as a solution. So if you don't mind, I'm actually gonna just go ahead and share\nmy screen with you. Are you able to see that Brian?"
    },
    {
      "timestamp": "9:16",
      "speaker": "Brian",
      "dialogue": "Yeah."
    },
    {
      "timestamp": "9:17",
      "speaker": "Nathan",
      "dialogue": "Yeah. So like why companies like decide to move forward with xyz is because they only really\nknow and have been able to really capture what's in their known funnel. So like someone\nsubmits a request for information, a demo requests, they fill out a form, they attend a webinar,\nit's like a very small portion of your buyer's journey. It's like about like 30 percent. What we do is\nlike we uncover the rest of the buyer journey that takes place like before they actually raise their\nhand. And we do that more accurately than anyone else in the space. And so these are\ncompanies that are browsing your website, browsing your competitors, websites, review sites\nlike they're going on your demo page. Like people that are just like in act of buying cycles, we're\ngoing to buy something whether it's you or not. So, what xyz does is how do we actually\nuncover this data for you? First things first, we'll capture your web activities that's your first party\ndata. So essentially, we place a tag on your site and we track every account that has visited\nyour site. Like once we place that tag, we take your third party data. So all."
    },
    {
      "timestamp": "10:21",
      "speaker": "Brian",
      "dialogue": "Matt, are we doing that today?"
    },
    {
      "timestamp": "10:22",
      "speaker": "Matt",
      "dialogue": "No, that's part of the reason why I've been looking at a couple of different solutions, to do\nthis. So, yeah, no, today, but why I've been talking to them?10:35 | Nathan\nYep... we take your third party data. So all of the buying activity that happens off of your\nwebsite. So essentially, we are able to upload an unlimited and customizable amount of\nkeywords. So anything specific to your business, think like healthcare enablement, think specific\ncompetitors that you see in deal cycles, we plug that into our system and are able to see who's\ndoing research on those keywords across a network of roughly one point 7,000,000 like B to B\npublishers."
    },
    {
      "timestamp": "11:06",
      "speaker": "Brian",
      "dialogue": "It on that, do you guys scale pricing based on a number of topics?"
    },
    {
      "timestamp": "11:11",
      "speaker": "Nathan",
      "dialogue": "No. So you have an unlimited amount of keywords, it's a little bit different which is important, to\nnote versus topics, with. Zoominfo. Topics are limited to the amount of topics, that they provide\nyou. They have like a hand select of what they're able to offer you what xyz of the value. And\nlike our keywords is that because they're customizable, you can track anything that's gonna be\nvery relevant to your business. So anything specific that you're thinking like even competitors\nname solutions that you have, we're able to do that differently than Zoominfo. And what that\nunlocks is essentially more revenue opportunities because you're able to track more indication\nof buying behavior. Good example of this is let's say your rep is in a deal. You just heard of a\ncompetitor that's in a deal that you've never heard of before. Matt can place the keyword into\nour system and in 24 to 48 hours track over the last 30 days like which accounts in your icp are\nactively researching that competitor. So our ability to tell you who's actively shopping for abc is\nreally the differentiator with xyz versus the likes of like a Zoom info or even the likes of like a\nDemand base who I understand that amwell had used as well. So we actually are able, to track\nback in 10 at a 30 to 40 percent higher clip when we actually put this data to the test."
    },
    {
      "timestamp": "12:33",
      "speaker": "Brian",
      "dialogue": "And do you have so with a like, do you have recommended keywords based on kind of the\nsuccess of leveraging those in the past? Or how does the errors at all? Just we plug in whatever\nwe want customized, how?"
    },
    {
      "timestamp": "12:50",
      "speaker": "Nathan",
      "dialogue": "Both, you can obviously start with whatever you'd like as far as the keywords that you want. We\ncould also provide some kind of recommendations based on what other customers that like abc\nare using. That's part of what, our adoption consultant like CSM team would help you with it's.\nIt's a fairly simple process as far as like where we take that data and help the folks like Matt is\nlike on the marketing side of the platform which we're not going to cover today, help Matt identify\nlike where these accounts are in their buyer journey. So he can use the appropriate messaging\nin the channel to like effectively advertise against them and then have that marketing source\npipeline be another element of how you use an account based strategy. So more effectively like\ndrive pipeline, for your sales team. So lastly, on the right side, we help tea this up for your sales\nteam in a way that is easily actionable. So we started as a marketing platform roughly a decadeago and that's gonna be as far as like the sales use case which will cover today. We launch this\njust over a year ago. And since then there's roughly been 160 customers\nthat have moved off of Zoominfo to xyz in like honestly a contact data right now is it's kind of a\ncommodity? Like a lot of vendors offer the same level, of contact data. And the accuracy and a\nsmall percentage point. What they don't offer is our level of intent. Our ability to tell you who's\nshopping at that higher clip is going to allow your reps to know and be able to get into more\ndeals faster because they know who like when people are hitting your site, when people are\ndoing research off of your site. So again, this is going to allow your team to more effectively\nknow who they should be going after because the right message at the wrong time is like still\nthe wrong message. Zoominfo has been a vendor that's done incredibly well over the last\ndecade because they were kind of the first in the space. But candidly, a lot of people have\ncaught up as far as the contact data accuracy, it's this intent part that we're really going to be\nable to help show you and help your reps actually get into more deals. So before I actually get\ninto like the, how we do this for your team. Any, any questions on this?"
    },
    {
      "timestamp": "15:11",
      "speaker": "Brian",
      "dialogue": "Yeah. I had a couple of questions on the contact info. So I primarily leverage e-mail it seemed\nlike Zoom info head based on the status that you showed had significantly more emails. Is that,\ndo you guys put a focus on phone numbers or can you walk me through that?"
    },
    {
      "timestamp": "15:29",
      "speaker": "Nathan",
      "dialogue": "Yeah. Let me reference what I was pulling up for you in the most recent numbers because they\nare often changing. We actually just published some new documentation on our contact data\nthat I can send as a follow up as far as like how we prioritize emails and phone numbers. I don't\nthink like we have like an active like, hey, we're only going to focus on phone numbers verse\nemails. It's a kind of rowing number that we have, but let me follow up with some additional\ndetails and like where we, where our investments are going if you will."
    },
    {
      "timestamp": "16:10",
      "speaker": "Brian",
      "dialogue": "Yeah. That mean, I don't necessarily need that. It's more kind of the numbers. And do you break\nthat down by market, right? So like what matters to us is health system contact info as I mean,\nthat's and, you know, some others, but that's really a priority, for me at least."
    },
    {
      "timestamp": "16:29",
      "speaker": "Nathan",
      "dialogue": "Yeah. I believe we're able to do that. As far as our coverage, in the space. Let me use that as a\nfollow up as well. It's just like the total amount of health care companies like."
    },
    {
      "timestamp": "16:37",
      "speaker": "Matt",
      "dialogue": "Were you, were you just flashing, the count different or are you looking somewhere else? Sorry,\nI missed it on the slides you were showing."
    },
    {
      "timestamp": "16:46",
      "speaker": "Nathan",
      "dialogue": "No, I think he's referencing, the e-mail that I had sent you at last week. Okay... cool. In whichcase, I think the use a good use of time would be to show you like how we'd accomplish this for\nthe healthcare. Obviously, you understand, like only emails and phone numbers should people\nin the healthcare space are gonna be relevant for you? We work with a ton of health care\ncompanies, to more effectively like understand who's shopping, and get that e-mail and contact\ndata. So let me share what it looks like for one of your like reps to be logging into."
    },
    {
      "timestamp": "17:27",
      "speaker": "Brian",
      "dialogue": "And on that, you know, you just reference, you work with a lot of health system or health care\ncompanies. I'm wondering if there are any of those that have, you know, made this switch over\nto you guys that we could potentially chat with. I don't know if that's something that you guys\noffer. But it might be helpful to understand their experience."
    },
    {
      "timestamp": "17:47",
      "speaker": "Nathan",
      "dialogue": "Yeah, off the bat, I don't, I have to go see which of those accounts fall in the space that you do.\nAnd I'm more than happy, to connect you with a reference. I just have to make sure that... we're\nprobably connecting with connecting you with someone that kind of looks like abc same site,\nyou know, similar size, making sure that it's gonna be relevant reference. So let me do some\ndigging on my end to make sure that we can connect you with the right people."
    },
    {
      "timestamp": "18:18",
      "speaker": "Brian",
      "dialogue": "Cool."
    },
    {
      "timestamp": "18:19",
      "speaker": "Nathan",
      "dialogue": "Sweet. One thing I'll mention here is I guess to preface like what we're seeing here is on this\nsales side of the platform, your team is going to walk away with a few things. It's it's what to\nprioritize, who should I be going after? What should I say to them? And then when you needed\ntheir contact information. So what's important to know? Matt, also, I know that we went through a\nmarketing demo is that all of what I'm showing here is working off of the same data set that the\nmarketing platform is built off of. So that same level of intent we're offering up the sales team just\npackaged in a different way that's going to fit your sellers workflow. That's essentially why we\ncreated this is like we, you know, heard what our customers were telling us is like, hey, like this\nintent data that you're providing our marketing team is great. Like we're pushing out those daily\nalerts to sales, but we want to way actionable for our sales team. So what you're seeing here, I,\nas a rep, this is like my dashboard. I have 126 accounts in my name. What xyz is going to do is\ntake the guesswork out and say of those 126 accounts based on the intent or lack of intent that\nthey're showing, allow me to prioritize which accounts that I should be targeting on a daily basis\nbecause candidly like even like 19 accounts on a daily basis is still too much for me to balance\namongst these types of calls that you're having, you know, with your prospects, your customers\nand so forth. So what xyz is telling me is that in my patch, I have 12 hot accounts based on the\nrecency of intent and like the frequency, and then the six hot new accounts. So that's where I'm\ngoing to spend my time are on those accounts?"
    },
    {
      "timestamp": "20:08",
      "speaker": "Matt",
      "dialogue": "Yeah, we would work together sales and marketing to identify those. I mean, we could, for\nstupidity sake, we could say we're gonna go after all 2000 ids or whatever, you know, 100. Yeah.\nSo I."
    },
    {
      "timestamp": "20:22",
      "speaker": "Nathan",
      "dialogue": "I guess a good question is, do you have like a name to countless like your sales reps or is it kind\nof the wild west?"
    },
    {
      "timestamp": "20:28",
      "speaker": "Matt",
      "dialogue": "We're still structuring. I mean, Brian has been on for, you know, a month. The, the whole sales\nteam is really young. So it's wild west right now for sure. Okay. Cool."
    },
    {
      "timestamp": "20:38",
      "speaker": "Nathan",
      "dialogue": "Cool. Helpful to know because of like, we can also use a different view that essentially just\nshows you like, okay, even of all of the accounts, you can upload an account list. You know,\nobviously, we integrate directly within your CRM. So we could work directly through an I frame,\nbut let's say to your point, Matt, if you have two, 2000 accounts that you want to plug in, what we\ncan do is show you sorry sec in this discovery that in the company, we could actually say like,\nhey, of a list of... 2000 companies, we can upload a company list, and then you can filter by\nintent website engagement and so forth. So we can see, hey, like of six senses urls are like\nvisited, let's see website visits in the last seven days, more than five. This is going to show a ton\nof accounts because this is like the universe of six sense accounts doing these research. But we\ncan get pretty specific to say, hey, of the accounts that are doing five visits, we want ones that\nare in the specific industry of like for me. Let's say healthcare."
    },
    {
      "timestamp": "21:57",
      "speaker": "Nathan",
      "dialogue": "And filter and so on and so forth in a way that's going to allow your sales reps to know all right,\nwhich of the accounts should I be focusing on immediately and prioritising them as such. So this\ncan be just like a quick way website visits. We could also do like intent keyword and layering on\nthese types of different signals is going to let them be more accurate. And what we can do is\nalso save some of these filters. So like, hey, like let's say like I don't want to continue to like\nbuild this out where it's like, all right, you know, I want to see accounts that are researching and\ncoming to our site but not filling out a form. I want to see who those accounts are, but I don't\nwant to build that every time we could save that filter and allow your reps to, accordingly. So ton\nof different workflows, that we can go. But what I do want to show you is like what an account\nview looks like of like once I find an account that's like showing some intent, what does that look\nlike? So let's say data axle is an account that I've been targeting. And I really want to go after\nthis is what it's going to show you as far as like what data axle is actually shopping for. I mean,\nwhat they're researching. So there's gonna be some good like information on the company onthe top... few tabs here. They're gonna be relevant for you, the timeline tab. So this is going to\ntell you a."
    },
    {
      "timestamp": "23:18",
      "speaker": "Matt",
      "dialogue": "Nate. Sorry?"
    },
    {
      "timestamp": "23:18",
      "speaker": "Brian",
      "dialogue": "Would you, would you be able to show like, a health system?"
    },
    {
      "timestamp": "23:24",
      "speaker": "Matt",
      "dialogue": "Yeah."
    },
    {
      "timestamp": "23:25",
      "speaker": "Nathan",
      "dialogue": "I mean, I just have to figure out like which one makes sense. It's gonna be the same level of\nintent. It just matter like the view is going to be the same."
    },
    {
      "timestamp": "23:35",
      "speaker": "Matt",
      "dialogue": "Well, I mean giving one, right? Brian I to."
    },
    {
      "timestamp": "23:38",
      "speaker": "Brian",
      "dialogue": "Yeah. So one I'm talking to WU, medicine would be a good one. Like we're actively talking with\nthem right now. It would be good to understand, you know, what can I see that, you know, are\nthey actually looking at what we're pitching them to?"
    },
    {
      "timestamp": "23:53",
      "speaker": "Matt",
      "dialogue": "He's not gonna be able to, he's not gonna be tell us because we don't have any tracking, on our\nsite, but he could maybe dive into a help."
    },
    {
      "timestamp": "24:00",
      "speaker": "Nathan",
      "dialogue": "Now?"
    },
    {
      "timestamp": "24:00",
      "speaker": "Matt",
      "dialogue": "And what consume?"
    },
    {
      "timestamp": "24:02",
      "speaker": "Nathan",
      "dialogue": "That's a good point like we're not tracking keywords, in your website that are gonna be relevant,\nfor abc. What we're tracking is, you know, our website engagement and the keywords that we've\nplugged in that are gonna be relevant for xyz. That's why just for the sake of an example like\nthis is like what the workflow and like the view would look like. We're more than happy to like\ntest our intent for abc, should that be something you want to explore? But like for the purpose of\nan example like this, should like essentially tell you as much as it would for that account. So just\nto give you some insight into like what these different tabs offer a timeline view. So this is gonna\ntell your reps on a daily basis what your company's that you're prioritizing and researching.\nYou'll see Bombora here. We actually have a partnership with Bombora, where as a part of yourxyz subscription, you're actually offer 12 free topics with Bombora. So they're actually the\nsecond leading intent provider as far as coverage. So essentially, with your six on subscription,\nwe would offer you that as well. But we're able to see which urls they're visiting and where\nthey're visiting from... again on this daily basis, palm beach gardens, Florida, you know,\nsomeone's looking up Demand based in westerville, Ohio. So that's a timeline view. We're\nalso able to see those keywords and from a third party in 10, what they're researching. So here\nwe're able to see the different generic keywords that's how we split it up. Matt, if you remember\nlike generic keywords are gonna be more top of the funnel keywords that are gonna be like\nhealth care enablement, and the branded keywords are gonna be like your product, name, your\ncompetitors name. So we're seeing that they've looked up Zoominfo five times. That's gonna be\nrelevant information for me, to know that they're in market not only for xyz but Zoominfo as well."
    },
    {
      "timestamp": "26:02",
      "speaker": "Brian",
      "dialogue": "And so is that these you said topics are different than keywords, what's a topic?"
    },
    {
      "timestamp": "26:09",
      "speaker": "Nathan",
      "dialogue": "So topics are how Zoominfo leverages third party in to keywords, is the differentiation of how\nsix?"
    },
    {
      "timestamp": "26:18",
      "speaker": "Brian",
      "dialogue": "Got it. Okay. Cool."
    },
    {
      "timestamp": "26:20",
      "speaker": "Nathan",
      "dialogue": "Yeah. So that's how we're gonna be able to track what's happening off of your site and then web\nactivities here. We're able to see all of the people who have visited, what are the top pages that\nthey're visiting? And those visitor locations of where they're coming from? We've got an account\nthat's based in Dallas, Texas, but we're seeing a ton of intent coming from Illinois, westerville,\nOhio, schaumburg, new York. This is where we're going to match the level of, you know, emails\nphone numbers that the rest of the market is showing is where, okay, now that I know who's\nactively shopping. Now, let's find the right contact information for those people. So what I'll click\nhere is when I go view all people, what I can get as specific to see. Hey, I knew that intent was\ncoming out of westerville. Let's start with... the location of where they're coming from."
    },
    {
      "timestamp": "27:24",
      "speaker": "Nathan",
      "dialogue": "And say, of data axle which is a 1,000 plus person company who's based in Ohio. And then\nfrom there, I can, you know, accurately get their e-mail their phone number, Beth, senior director\nof marketing. It's a persona that we would typically target... versus Larry who's an account\nexecutive. We're typically not our buyer. I'll click into beth's profile here. And then what I can\ngrab is her e-mail address and mobile phone number here. So, I know that was very quick, but\nthat would be like a workflow that your sales team would use to kind of wrap that up. Like I\nmentioned before, what's going to really move the needle in terms of making sure that you're\nreaching the right people at the right time? Is that we're able to track back more accounts and\nde anonymize more accounts. And we're able to do that, at a much higher clip than the rest oflikely who you're looking at. So a pause as far as like what we're saying, is kind of like fit the\ndescription of like what you were hoping to see. Keep me honest? Like, what else would you\nwant to be seeing here?"
    },
    {
      "timestamp": "28:42",
      "speaker": "Brian",
      "dialogue": "Sorry, say that one more time."
    },
    {
      "timestamp": "28:44",
      "speaker": "Nathan",
      "dialogue": "Yeah. As."
    },
    {
      "timestamp": "28:45",
      "speaker": "Matt",
      "dialogue": "Far as work. Is there something?"
    },
    {
      "timestamp": "28:46",
      "speaker": "Nathan",
      "dialogue": "Anything else that you, you'd like to see as far as like what we're able, to help with?"
    },
    {
      "timestamp": "28:51",
      "speaker": "Brian",
      "dialogue": "Hey, Matt, this is probably you're probably managing this conversation, but from a user\nstandpoint, are we limited or capped on the number of users that are leveraging the platform?"
    },
    {
      "timestamp": "29:02",
      "speaker": "Nathan",
      "dialogue": "No, we price for our sales side of the platform based on users and credits. So we would\njust need to know like how many users do you anticipate leveraging here? And in credits,\nit's essentially like unlocking contact information. So a credit unlocks."
    },
    {
      "timestamp": "29:18",
      "speaker": "Matt",
      "dialogue": "E-mail phone?"
    },
    {
      "timestamp": "29:19",
      "speaker": "Nathan",
      "dialogue": "Number. And if like the work phone number is included as well, that's still included in that same\ncredit. So that's how we would price out based on, would you probably use a similar amount of\nusers that definitive just definitive healthcare price in the same way by the way?"
    },
    {
      "timestamp": "29:37",
      "speaker": "Matt",
      "dialogue": "And, and there's just kind of funky because they have different databases. And then there's a\nuser component, but the majority of the cost structure is in the databases you access."
    },
    {
      "timestamp": "29:47",
      "speaker": "Nathan",
      "dialogue": "Okay."
    },
    {
      "timestamp": "29:48",
      "speaker": "Matt",
      "dialogue": "Because they have a clinic database, they have a health system database, they have a\nprovider database. They have claims data and like it's all into that bucket. So... yeah. So it'sdifferent in that sense. Okay?"
    },
    {
      "timestamp": "30:06",
      "speaker": "Nathan",
      "dialogue": "Okay. Do you know that you'd likely move forward with?"
    },
    {
      "timestamp": "30:12",
      "speaker": "Matt",
      "dialogue": "It would... probably be fewer, well, I don't know. Maybe, I mean, if you consider account\nmanagement, they probably would want something like this now."
    },
    {
      "timestamp": "30:25",
      "speaker": "Brian",
      "dialogue": "Well, yeah, I mean, I guess I could for kind of at risk accounts and whatnot. So, yeah, it's a good\npoint. I hadn't thought about it. I'm selfishly thinking about it from the sales side. So I hadn't\nthought about that, but I'm guessing, they might."
    },
    {
      "timestamp": "30:40",
      "speaker": "Nathan",
      "dialogue": "And we can start is."
    },
    {
      "timestamp": "30:41",
      "speaker": "Matt",
      "dialogue": "Probably like six, six or so right now is probably our right number, but, yeah."
    },
    {
      "timestamp": "30:47",
      "speaker": "Nathan",
      "dialogue": "Okay. One of the things that we'll also often see Brian and an Matt, for your contacts as well is\nthat you likely won't need as many credits with xyz then you will with Zoominfo because we're\nable again like because you know, how a, which accounts you should be going after? It's less\nof a spray and pray approach... versus like, the alternative and the way that they allot their\ncredits is a little bit differently as well. They'll give you a monthly allotment of credits that each\nrep has to use. And there's no like pushing to other reps where it's like, you know, let's say, for\nexample, you know, both of your sales reps and both of you have 3,000 credits like Matt, if you\ndon't use your 3,000 credits in that month, those don't roll over... xyz. We offer credits on a\nyearly basis that you can allot however you see fit. So, Matt, if you want."
    },
    {
      "timestamp": "31:43",
      "speaker": "Matt",
      "dialogue": "It's a pull across the six basically."
    },
    {
      "timestamp": "31:45",
      "speaker": "Nathan",
      "dialogue": "Yeah. So if you want a license... and you don't plan to prospect, but you do want the initial intent\nassuming that you were to start with like the sales side and not the marketing as well upfront.\nAnd you still want that intent, we can give you that license. But don't necessarily need to give\nyou those credits. So."
    },
    {
      "timestamp": "32:08",
      "speaker": "Matt",
      "dialogue": "We, we would, if we were doing this and we'd probably go up to both sides, it just makes sense\nthe marketing is helping... and being aligned with, that ABM strategy. So, I.32:20 | Nathan\ncool."
    },
    {
      "timestamp": "32:21",
      "speaker": "Matt",
      "dialogue": "Abm has been a passion project of mind for the last year or so. So."
    },
    {
      "timestamp": "32:26",
      "speaker": "Brian",
      "dialogue": "You told me what it means and I forget. Again, so."
    },
    {
      "timestamp": "32:29",
      "speaker": "Matt",
      "dialogue": "A cow based marketing. So it's really being surgical versus just like spread and praying with\nmarketing. So."
    },
    {
      "timestamp": "32:40",
      "speaker": "Nathan",
      "dialogue": "Well, I know we're a few minutes over here. So I think it would be helpful, maybe mad if you\nwant to reconnect, maybe like later this week just to like talk through what else you might need\nto see on the sales side as far as like giving you all the information you need to make an\neducated decision. It sounds like is the sales side something that you plan on moving on quicker\nthan the marketing side? Or, or Matt, are you saying both would be likely a?"
    },
    {
      "timestamp": "33:10",
      "speaker": "Matt",
      "dialogue": "It would probably be a combined thing. And so, you know, me, Brian, and corona get together\nand discuss it, and make a pitch for how we're going to do it and probably use some of your\nmetrics and data as to how you can help fast track the pipe and all of those things to help make\nthe business case. So."
    },
    {
      "timestamp": "33:27",
      "speaker": "Nathan",
      "dialogue": "Yeah, I."
    },
    {
      "timestamp": "33:28",
      "speaker": "Matt",
      "dialogue": "ROI, it meets sales requirements. So."
    },
    {
      "timestamp": "33:32",
      "speaker": "Nathan",
      "dialogue": "Yeah, yeah, of course. Cool. Well, I'm happy to meet with the both of you. Matt, I can meet with\nyou separately if you want to like just figure out for like maybe 15 minutes on Thursday or\nFriday. It's like, hey, where do we wanna take this from here?"
    },
    {
      "timestamp": "33:44",
      "speaker": "Matt",
      "dialogue": "Yeah, I think the key to it is understanding the cost structure on the sales side. I think we've\nalready discussed in the marketing. So, getting a kind of soup to nut costs on both pieces. I will\nbe important."
    },
    {
      "timestamp": "34:12",
      "speaker": "Matt",
      "dialogue": "So, hey, I have a, I have a question. Has xyz been in the news lately?"
    },
    {
      "timestamp": "34:19",
      "speaker": "Nathan",
      "dialogue": "Not that, I know of too much."
    },
    {
      "timestamp": "34:23",
      "speaker": "Matt",
      "dialogue": "Yeah."
    },
    {
      "timestamp": "34:23",
      "speaker": "Nathan",
      "dialogue": "What, what are you reference?"
    },
    {
      "timestamp": "34:28",
      "speaker": "Matt",
      "dialogue": "One of your competitors reached out to Brian and was like, hey, did you see the news of RB,\ntwo BB and xyz a?"
    },
    {
      "timestamp": "34:37",
      "speaker": "Brian",
      "dialogue": "We're."
    },
    {
      "timestamp": "34:38",
      "speaker": "Matt",
      "dialogue": "like, yeah, blue or mines?"
    },
    {
      "timestamp": "34:41",
      "speaker": "Nathan",
      "dialogue": "Honestly, there's so much going on out there that like, I don't keep track of all of it. I feel like, I\ntry to keep some horse blinders on of like, you know, I've got my own quote ahead. I don't know."
    },
    {
      "timestamp": "34:53",
      "speaker": "Brian",
      "dialogue": "Do you know what rbtwobb, is, have you ever heard of that?"
    },
    {
      "timestamp": "34:58",
      "speaker": "Nathan",
      "dialogue": "I've heard of them. Are they pretty small player in the space?"
    },
    {
      "timestamp": "35:02",
      "speaker": "Brian",
      "dialogue": "I don't know we couldn't find the way."
    },
    {
      "timestamp": "35:04",
      "speaker": "Matt",
      "dialogue": "We don't know what they are. Yeah, we don't know. So, yeah."
    },
    {
      "timestamp": "35:11",
      "speaker": "Matt",
      "dialogue": "It sounds like one of your competitors trying to send, a really weird message to get a response\nthough. We've just been messing with you."
    },
    {
      "timestamp": "35:21",
      "speaker": "Nathan",
      "dialogue": "Okay. Let me know if they're saying anything interesting there."
    },
    {
      "timestamp": "35:26",
      "speaker": "Brian",
      "dialogue": "He actually mentioned by name, so."
    },
    {
      "timestamp": "35:28",
      "speaker": "Nathan",
      "dialogue": "He mentioned Nate got account executive based in Florida."
    },
    {
      "timestamp": "35:32",
      "speaker": "Brian",
      "dialogue": "Yeah, no."
    },
    {
      "timestamp": "35:35",
      "speaker": "Nathan",
      "dialogue": "That's too funny. All right. Well, maybe I'll take a look, but, Matt, you wanna, I got to run to hop\non another call. Matt, you wanna grab time on?"
    },
    {
      "timestamp": "35:46",
      "speaker": "Matt",
      "dialogue": "Yeah, that's fine. Thursday is preferred over Friday, so."
    },
    {
      "timestamp": "35:53",
      "speaker": "Nathan",
      "dialogue": "What's the afternoon? Look in the?"
    },
    {
      "timestamp": "35:54",
      "speaker": "Matt",
      "dialogue": "Bryan, if you need the bounce, it's fine and we can."
    },
    {
      "timestamp": "35:55",
      "speaker": "Brian",
      "dialogue": "Yeah, I'm gonna help. All right. So you go."
    },
    {
      "timestamp": "35:59",
      "speaker": "Nathan",
      "dialogue": "Brian, thanks you. How is three o'clock or 12 o'clock on Friday? I'm Thursday, sorry?"
    },
    {
      "timestamp": "36:08",
      "speaker": "Matt",
      "dialogue": "I can do to three."
    },
    {
      "timestamp": "36:10",
      "speaker": "Nathan",
      "dialogue": "Cool. Let's meet on Thursday. I'll come prepared with some pricing and then we can talk to you\nlike what some of those next steps look like, appreciate the time I got a hop. Thanks sounds.36:20 | Matt\nGood."
    }
  ]
}